import { v4 as uuidv4 } from 'uuid';
import type { Product } from '../types/types';

const products: Product[] = [
  {
    id: uuidv4(),
    title: "МП-20 Коричневый (1150х0.35мм)",
    description: "Профнастил МП-20, ширина 1.15м, толщина 0.35мм, коричневый цвет. Используется для заборов и облицовки. Цена зависит от длины.",
    image: `/images/профнастил/mp1.webp`,
    mainCategory: "Профнастил",
    subCategory: "МП-20",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "1.5м": 800,
      "1.7м": 900,
      "2м": 1000
    },
    urlId: "mp-20-korichnevyy"
  },
  {
    id: uuidv4(),
    title: "МП-20 Красный (1150х0.35мм)",
    description: "Профнастил МП-20, ширина 1.15м, толщина 0.35мм, красный цвет. Используется для заборов и облицовки. Цена зависит от длины.",
    image: `/images/профнастил/mp2.webp`,
    mainCategory: "Профнастил",
    subCategory: "МП-20",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "1.5м": 800,
      "1.7м": 900,
      "2м": 1000
    },
    urlId: "mp-20-krasnyy"
  },
  {
    id: uuidv4(),
    title: "МП-20 синий (1150х0.35мм)",
    description: "Профнастил МП-20, ширина 1.15м, толщина 0.35мм, синий цвет. Используется для заборов и облицовки. Цена зависит от длины.",
    image: `/images/профнастил/mp3.webp`,
    mainCategory: "Профнастил",
    subCategory: "МП-20",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "1.5м": 800,
      "1.7м": 900,
      "2м": 1000
    },
    urlId: "mp-20-siniy"
  },
  {
    id: uuidv4(),
    title: "МП-20 зелёный (1150х0.35мм)",
    description: "Профнастил МП-20, ширина 1.15м, толщина 0.35мм, зелёный цвет. Используется для заборов и облицовки. Цена зависит от длины.",
    image: `/images/профнастил/mp4.webp`,
    mainCategory: "Профнастил",
    subCategory: "МП-20",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "1.5м": 800,
      "1.7м": 900,
      "2м": 1000
    },
    urlId: "mp-20-zelenyy"
  },
  {
    id: uuidv4(),
    title: "МП-20 графит (1150х0.35мм)",
    description: "Профнастил МП-20, ширина 1.15м, толщина 0.35мм, цвет графит. Используется для заборов и облицовки. Цена зависит от длины.",
    image: `/images/профнастил/mp5.webp`,
    mainCategory: "Профнастил",
    subCategory: "МП-20",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "1.5м": 800,
      "1.7м": 900,
      "2м": 1000
    },
    urlId: "mp-20-grafit"
  },
  {
    id: uuidv4(),
    title: "МП-20 оцинкованный (1150х0.35мм)",
    description: "Оцинкованный профнастил МП-20, ширина 1.15м, толщина 0.35мм. Устойчив к коррозии. Цена зависит от длины.",
    image: `/images/профнастил/mp6.webp`,
    mainCategory: "Профнастил",
    subCategory: "МП-20",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "1.5м": 650,
      "1.7м": 750,
      "2м": 850
    },
    urlId: "mp-20-otsinkovannyy"
  },
  {
    id: uuidv4(),
    title: "С-8 белый (2000х1150х0.35мм)",
    description: "Профнастил С-8, ширина 1.15м, толщина 0.35мм, белый цвет. Подходит для стен и облицовки. Длина — 2м. Не рекомендуется для кровли.",
    image: `/images/профнастил/c1.webp`,
    mainCategory: "Профнастил",
    subCategory: "С-8",
    price: 1000,
    urlId: "s-8-belyy"
  },
  {
    id: uuidv4(),
    title: "С-8 слоновая кость (2000х1150х0.35мм)",
    description: "Профнастил С-8, ширина 1.15м, толщина 0.35мм, цвет слоновая кость. Подходит для стен и облицовки. Длина — 2м. Не рекомендуется для кровли.",
    image: `/images/профнастил/c2.webp`,
    mainCategory: "Профнастил",
    subCategory: "С-8",
    price: 1000,
    urlId: "s-8-slonovaya-kost"
  },
  {
    id: uuidv4(),
    title: "С-8 коричневый (2000х1150х0.35мм)",
    description: "Профнастил С-8, ширина 1.15м, толщина 0.35мм, коричневый цвет. Подходит для стен и облицовки. Длина — 2м. Не рекомендуется для кровли.",
    image: `/images/профнастил/c3.webp`,
    mainCategory: "Профнастил",
    subCategory: "С-8",
    price: 1000,
    urlId: "s-8-korichnevyy"
  },
  {
    id: uuidv4(),
    title: "С-8 морёный дуб (2000х1150х0.35мм)",
    description: "Профнастил С-8, ширина 1.15м, толщина 0.35мм, цвет морёный дуб. Подходит для стен и облицовки. Длина — 2м. Не рекомендуется для кровли.",
    image: `/images/профнастил/c4.webp`,
    mainCategory: "Профнастил",
    subCategory: "С-8",
    price: 1800,
    urlId: "s-8-morenyy-dub"
  },
  {
    id: uuidv4(),
    title: "С-8 камень (2000х1150х0.35мм)",
    description: "Профнастил С-8, ширина 1.15м, толщина 0.35мм, цвет камень. Подходит для стен и облицовки. Длина — 2м. Не рекомендуется для кровли.",
    image: `/images/профнастил/c5.webp`,
    mainCategory: "Профнастил",
    subCategory: "С-8",
    price: 1800,
    urlId: "s-8-kamen"
  },
  {
    id: uuidv4(),
    title: "Волма Слой",
    description: "Гипсовая штукатурка для выравнивания стен и потолков внутри помещений. Расход: 8–9 кг на 1 м² при слое 10 мм. Рекомендованная толщина слоя — 5–30 мм, максимум — до 60 мм",
    image: `/images/смеси/штук/слой.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Штукатурка",
    price: 430,
    urlId: "volma-sloy"
  },
  {
    id: uuidv4(),
    title: "Волма Старт",
    description: "Выравнивающая гипсовая штукатурка для черновой отделки. Подходит для внутренних работ по стабильным основаниям.",
    image: `/images/смеси/штук/старт.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Штукатурка",
    price: 300,
    urlId: "volma-start"
  },
  {
    id: uuidv4(),
    title: "Волма Гипс-актив",
    description: "Быстросохнущая гипсовая штукатурка для выравнивания поверхностей. Используется для внутренней отделки стен и потолков.",
    image: `/images/смеси/штук/актив.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Штукатурка",
    price: 350,
    urlId: "volma-gips-aktiv"
  },
  {
    id: uuidv4(),
    title: "Волма Гипс-актив Экстра",
    description: "Улучшенная формула штукатурки с высокой адгезией. Подходит для выравнивания минеральных оснований внутри помещений.",
    image: `/images/смеси/штук/активэкстра.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Штукатурка",
    price: 350,
    urlId: "volma-gips-aktiv-ekstra"
  },
  {
    id: uuidv4(),
    title: "Knauf MP 75",
    description: "Гипсовая штукатурка для машинного нанесения. Предназначена для высококачественного оштукатуривания стен и потолков внутри помещений с нормальной влажностью, включая кухни и ванные комнаты (при наличии защитного покрытия)",
    image: `/images/смеси/штук/мп75.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Штукатурка",
    price: 380,
    urlId: "knauf-mp-75"
  },
  {
    id: uuidv4(),
    title: "Литокс Start",
    description: "Гипсовая штукатурка для выравнивания стен и потолков внутри помещений. Обладает высокой пластичностью и удобна в нанесении.",
    image: `/images/смеси/штук/литстарт.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Штукатурка",
    price: 300,
    urlId: "litoks-start"
  },
  {
    id: uuidv4(),
    title: "Литокс AquaPlast",
    description: "Штукатурка с повышенной влагостойкостью. Подходит для помещений с повышенной влажностью.",
    image: `/images/смеси/штук/литаквапласт.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Штукатурка",
    price: 500,
    urlId: "litoks-aquaplast"
  },
  {
    id: uuidv4(),
    title: "Волма Аквапласт",
    description: "Гипсовая штукатурка с добавками, повышающими водостойкость. Применяется в помещениях с нормальной влажностью.",
    image: `/images/смеси/штук/аквапласт.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Штукатурка",
    price: 400,
    urlId: "volma-akvaplast"
  },
  {
    id: uuidv4(),
    title: "Литокс CemPlast",
    description: "Цементная штукатурка с пластификаторами. Используется для наружных и внутренних работ.",
    image: `/images/смеси/штук/цемпласт.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Штукатурка",
    price: 370,
    urlId: "litoks-cemplast"
  },
  {
    id: uuidv4(),
    title: "Power Fasad",
    description: "Фасадная штукатурка на цементной основе. Устойчива к атмосферным воздействиям, морозу и влаге.",
    image: `/images/смеси/штук/повер.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Штукатурка",
    price: 300,
    urlId: "power-fasad"
  },
  {
    id: uuidv4(),
    title: "Волма Шов",
    description: "Сухая смесь на основе гипса для заделки швов и трещин в гипсокартонных конструкциях.",
    image: `/images/смеси/шпат/шов.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Шпатлёвка",
    price: 430,
    urlId: "volma-shov"
  },
  {
    id: uuidv4(),
    title: "Волма Финиш",
    description: "Мелкозернистая шпатлёвка для финишного выравнивания поверхностей перед покраской или оклейкой обоев.",
    image: `/images/смеси/шпат/финиш.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Шпатлёвка",
    price: 420,
    urlId: "volma-finish"
  },
  {
    id: uuidv4(),
    title: "Литокс SatenLux",
    description: "Финишная акриловая шпатлёвка для внутренних работ. Обеспечивает гладкую поверхность перед покраской.",
    image: `/images/смеси/шпат/сатен.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Шпатлёвка",
    price: 500,
    urlId: "litoks-satenlux"
  },
  {
    id: uuidv4(),
    title: "Волма Аквастандарт",
    description: "Шпатлёвка с улучшенной водостойкостью для внутренних работ, в том числе в помещениях с повышенной влажностью.",
    image: `/images/смеси/шпат/аквастандарт.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Шпатлёвка",
    price: 400,
    urlId: "volma-akvastandart"
  },
  {
    id: uuidv4(),
    title: "Волма Аквастандарт Светлый",
    description: "Светлая шпатлёвка с высокой водостойкостью, подходит для влажных помещений и финишной отделки.",
    image: `/images/смеси/шпат/аквастандартсветлый.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Шпатлёвка",
    price: 570,
    urlId: "volma-akvastandart-svetlyy"
  },
  {
    id: uuidv4(),
    title: "Шпатлёвка полимерная Vetonit LR+",
    description: "Универсальная финишная шпатлёвка на акриловой основе для внутренних работ. Образует гладкую поверхность перед покраской.",
    image: `/images/смеси/шпат/ветонит.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Шпатлёвка",
    price: 1050,
    urlId: "shpatlevka-polimernaya-vetonit-lr"
  },
  {
    id: uuidv4(),
    title: "Шпатлёвка полимерная Старатели КР",
    description: "Финишная шпатлёвка для выравнивания стен и потолков перед окончательной отделкой.",
    image: `/images/смеси/шпат/старатели.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Шпатлёвка",
    price: 650,
    urlId: "shpatlevka-polimernaya-starateli-kr"
  },
  {
    id: uuidv4(),
    title: "Декоративная штукатурка Литокс Короед",
    description: "Декоративная фасадная штукатурка с зерном 2.5 или 3.5 мм. Используется для создания текстуры «короед».",
    image: `/images/смеси/koroed.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Декоративная штукатурка",
    sizeText: "Выберите фракцию зерна:",
    pricesBySize: {
      "2.5мм": 600,
      "3.5мм": 600
    },
    urlId: "dekorativnaya-shtukaturka-litoks-koroed"
  },
  {
    id: uuidv4(),
    title: "Волма Нивелир 20кг",
    description: "Самовыравнивающаяся смесь для пола. Подходит для устройства стяжки с минимальными трудозатратами.",
    image: `/images/смеси/пол/нивелир20.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Смеси для пола",
    price: 300,
    urlId: "volma-nivelir-20kg"
  },
  {
    id: uuidv4(),
    title: "Волма Нивелир Экспресс 25кг",
    description: "Быстротвердеющая смесь для выравнивания полов внутри помещений. Обладает высокой прочностью.",
    image: `/images/смеси/пол/нивелир25.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Смеси для пола",
    price: 430,
    urlId: "volma-nivelir-ekspress-25kg"
  },
  {
    id: uuidv4(),
    title: "Литокс Композит",
    description: "Сухая смесь для устройства прочного и устойчивого к нагрузкам наливного пола. Подходит для тёплого пола.",
    image: `/images/смеси/пол/композит.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Смеси для пола",
    price: 500,
    urlId: "litoks-kompozit"
  },
  {
    id: uuidv4(),
    title: "Литокс Floorex",
    description: "Наливной пол на основе цемента и полимеров. Подходит для быстрого выравнивания основания.",
    image: `/images/смеси/пол/флорекс.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Смеси для пола",
    price: 500,
    urlId: "litoks-floorex"
  },
  {
    id: uuidv4(),
    title: "Наливной пол Старатели",
    description: "Самовыравнивающаяся смесь для пола, используется как основа под линолеум, ламинат, ковролин и другие покрытия.",
    image: `/images/смеси/пол/старатели.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Смеси для пола",
    price: 350,
    urlId: "nalivnoy-pol-starateli"
  },
  {
    id: uuidv4(),
    title: "Power Nivelir",
    description: "Самовыравнивающаяся смесь для пола. Используется для устройства ровной основы под укладку напольных покрытий.",
    image: `/images/смеси/пол/повер.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Смеси для пола",
    price: 380,
    urlId: "power-nivelir"
  },
  {
    id: uuidv4(),
    title: "Пескобетон ProfMix М300",
    description: "Цементная смесь на основе песка и цемента, марка прочности М300. Применяется для стяжки пола, устройства оснований и монтажных работ.",
    image: `/images/смеси/пол/м300.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Смеси для пола",
    price: 180,
    urlId: "peskobeton-profmix-m300"
  },
  {
    id: uuidv4(),
    title: "Волма Керамик +",
    description: "Клеевая смесь для укладки керамической плитки. Обладает повышенной пластичностью и адгезией. Подходит для внутренних и наружных работ. Подходит для теплого пола.",
    image: `/images/смеси/плитклей/т20.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Плиточный клей",
    price: 400,
    urlId: "volma-keramik"
  },
  {
    id: uuidv4(),
    title: "Волма Мультиклей",
    description: "Универсальный плиточный клей для укладки керамической плитки и мозаики на разные типы оснований. Подходит для теплого пола.",
    image: `/images/смеси/плитклей/т34.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Плиточный клей",
    price: 500,
    urlId: "volma-multikley"
  },
  {
    id: uuidv4(),
    title: "Ceresit СМ 11",
    description: "Стандартный плиточный клей для внутренних и наружных работ. Подходит для керамической плитки на бетоне и цементных стяжках",
    image: `/images/смеси/плитклей/см11.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Плиточный клей",
    price: 530,
    urlId: "ceresit-sm-11"
  },
  {
    id: uuidv4(),
    title: "Ceresit СМ 14",
    description: "Улучшенный клей для плитки с увеличенным временем коррекции. Подходит для внутренних и наружных работ. ",
    image: `/images/смеси/плитклей/см14.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Плиточный клей",
    price: 800,
    urlId: "ceresit-sm-14"
  },
  {
    id: uuidv4(),
    title: "Ceresit СМ 16",
    description: "Высокопрочный клевой состав для укладки крупноформатной плитки и керамогранита. Подходит для внутренних и наружных работ.",
    image: `/images/смеси/плитклей/см16.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Плиточный клей",
    price: 1350,
    urlId: "ceresit-sm-16"
  },
  {
    id: uuidv4(),
    title: "Ceresit СМ 17",
    description: "Плиточный клей для внутренних и наружных работ с двойным временем открытой пленки. Подходит для облицовки полов и стен в сложных условиях.",
    image: `/images/смеси/плитклей/см17.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Плиточный клей",
    price: 2000,
    urlId: "ceresit-sm-17"
  },
  {
    id: uuidv4(),
    title: "Мега Стандарт",
    description: "Универсальный плиточный клей для внутренних и наружных работ. Обладает хорошей адгезией к различным основаниям.",
    image: `/images/смеси/плитклей/мега.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Плиточный клей",
    price: 300,
    urlId: "mega-standart"
  },
  {
    id: uuidv4(),
    title: "Мега Керамогранит",
    description: "Усиленный клей для укладки керамогранита и тяжелых видов плитки. Обеспечивает надежное сцепление с основанием.",
    image: `/images/смеси/плитклей/керамогранит.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Плиточный клей",
    price: 370,
    urlId: "mega-keramogranit"
  },
  {
    id: uuidv4(),
    title: "Хабез Стандарт",
    description: "Плиточный клей для внутренних и наружних работ по  облицовке стен и полов керамической, мозаичной плиткой малого и среднего размера. Подходит для теплого пола.",
    image: `/images/смеси/плитклей/хабез.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Плиточный клей",
    price: 300,
    urlId: "habez-standart"
  },
  {
    id: uuidv4(),
    title: "Power Ceramic",
    description: "Клеевая смесь для укладки керамической плитки и керамогранита внутри и снаружи помещений.",
    image: `/images/смеси/плитклей/повер.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Плиточный клей",
    price: 300,
    urlId: "power-ceramic"
  },
  {
    id: uuidv4(),
    title: "Литокс Бриз",
    description: "Штукатурно-клеевая смесь для укладки теплоизоляции и выравнивания стен. Подходит для минераловатных плит.",
    image: `/images/смеси/штуккл/бриз.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Штукатурно-клеевая смесь",
    price: 500,
    urlId: "litoks-briz"
  },
  {
    id: uuidv4(),
    title: "Knauf Севенер",
    description: "Смесь для приклеивания теплоизоляции из минеральной ваты на стены и потолки. Используется внутри и снаружи зданий.",
    image: `/images/смеси/штуккл/севенер.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Штукатурно-клеевая смесь",
    price: 850,
    urlId: "knauf-sevener"
  },
  {
    id: uuidv4(),
    title: "Power Teplofix",
    description: "Клеевая смесь для монтажа утеплителя. Обеспечивает прочное сцепление с минеральными основаниями.",
    image: `/images/смеси/штуккл/повер.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Штукатурно-клеевая смесь",
    price: 500,
    urlId: "power-teplofix"
  },
  {
    id: uuidv4(),
    title: "Волма Монтаж",
    description: "Сухая смесь для приклеивания гипсокартона, пенополистирола, минераловатных плит и выравнивания поверхностей.",
    image: `/images/смеси/монтаж/волма.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Монтажный клей",
    price: 500,
    urlId: "volma-montazh"
  },
  {
    id: uuidv4(),
    title: "Хабез Мелисса",
    description: "Клеевая смесь для утепления фасадов и внутренних поверхностей. Обладает высокой адгезией к минеральным основаниям.",
    image: `/images/смеси/монтаж/хабез.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Монтажный клей",
    price: 450,
    urlId: "habez-melissa"
  },
  {
    id: uuidv4(),
    title: "Волма Блок",
    description: "Клеевая смесь для кладки газобетонных и пенобетонных блоков. Обеспечивает тонкий шов и высокую прочность.",
    image: `/images/смеси/блок/волма.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Клей для блоков",
    price: 380,
    urlId: "volma-blok"
  },
  {
    id: uuidv4(),
    title: "Литокс Контакт",
    description: "Клей для кладки газобетона. Обеспечивает минимальную толщину шва и высокую адгезию.",
    image: `/images/смеси/блок/литокс.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Клей для блоков",
    price: 340,
    urlId: "litoks-kontakt"
  },
  {
    id: uuidv4(),
    title: "Мега Блок Монтаж",
    description: "Клеевая смесь для кладки газобетонных и пенобетонных блоков. Обладает высокой прочностью и удобством нанесения.",
    image: `/images/смеси/блок/мега.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Клей для блоков",
    price: 300,
    urlId: "mega-blok-montazh"
  },
  {
    id: uuidv4(),
    title: "Profmix Профи-Блок",
    description: "Специализированный клей для кладки газобетонных блоков. Подходит для ручного и механизированного нанесения.",
    image: `/images/смеси/блок/профмикс.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Клей для блоков",
    price: 300,
    urlId: "profmix-profi-blok"
  },
  {
    id: uuidv4(),
    title: "Цемент Extra Cem 500+",
    description: "Цемент марки М500 с улучшенными прочностными характеристиками. Используется для приготовления строительных растворов и бетонов.",
    image: `/images/смеси/cement.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Цемент",
    price: 480,
    urlId: "tsement-extra-cem-500"
  },
  {
    id: uuidv4(),
    title: "Затирка Ceresit CE33",
    description: "Цементная затирка для швов от 1 до 6 мм . Подходит для керамической плитки, камня, стекла и мозаики. Обладает противогрибковым эффектом , защищает от плесени и пятен. Применяется внутри и снаружи помещений , в том числе во влажных зонах.",
    image: `/images/смеси/затирка/се33.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Затирка для плитки",
    sizeText: "Выберите цвет:",
    pricesBySize: {
      "Серый": 400,
      "Серебристо-серый": 450,
      "Графит": 450,
      "Антрацит": 450,
      "Светло-коричневый": 450,
      "Розовый": 450,
      "Роса": 400,
      "Натура": 400,
      "Манхеттен": 400,
      "Карамель": 400,
      "Жасмин": 400,
      "Белый": 400
    },
    urlId: "zatirka-ceresit-ce33"
  },
  {
    id: uuidv4(),
    title: "Затирка Ceresit CE40",
    description: "Эпоксидно-цементная затирка для швов шириной от 2 до 20 мм . Устойчива к химическим веществам, влаге и загрязнениям. Используется для плитки в бассейнах, ванных, на кухнях и в общественных зонах.",
    image: `/images/смеси/затирка/се40.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Затирка для плитки",
    sizeText: "Выберите цвет:",
    pricesBySize: {
      "Серый": 600,
      "Серебристо-серый": 600,
      "Мрамор белый": 600,
      "Графит": 700,
      "Белый": 500,
      "Антрацит": 650
    },
    urlId: "zatirka-ceresit-ce40"
  },
  {
    id: uuidv4(),
    title: "Затирка Литокол",
    description: "Цементная затирка с противогрибковыми добавками. Подходит для швов шириной от 1 до 6 мм . Используется для керамики, мозаики и камня внутри и снаружи помещений.",
    image: `/images/смеси/затирка/литокол.webp`,
    mainCategory: "Сухие смеси",
    subCategory: "Затирка для плитки",
    sizeText: "Выберите цвет:",
    pricesBySize: {
      "Жасмин": 450,
      "Багамы": 450,
      "Песочный": 450
    },
    urlId: "zatirka-litokol"
  },
  {
    id: uuidv4(),
    title: "ОСП пропитка 1 сторона (2440х1220мм)",
    description: "Ориентированно-стружечная плита с защитной пропиткой с одной стороны. Применяется для обшивки стен, перегородок, обрешетки и временных конструкций.",
    image: `/images/плиты/осп.webp`,
    mainCategory: "Древесные плиты",
    subCategory: "ОСП",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "9мм": 700,
      "12мм": 950,
      "15мм": 1200
    },
    urlId: "osp-propitka-1-storona"
  },
  {
    id: uuidv4(),
    title: "ОСП пропитка 2 стороны (2440х1220мм)",
    description: "ОСП с защитной пропиткой с обеих сторон. Обладает повышенной влагостойкостью и прочностью. Используется в условиях повышенной влажности и для наружных работ.",
    image: `/images/плиты/осп.webp`,
    mainCategory: "Древесные плиты",
    subCategory: "ОСП",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "9мм": 750,
      "12мм": 1050
    },
    urlId: "osp-propitka-2-storony"
  },
  {
    id: uuidv4(),
    title: "ДСП (2440х1830х16мм)",
    description: "Древесно-стружечная плита стандартного качества. Применяется для изготовления мебели, перегородок и временных конструкций.",
    image: `/images/плиты/дсп.webp`,
    mainCategory: "Древесные плиты",
    subCategory: "ДСП",
    price: 1800,
    urlId: "dsp"
  },
  {
    id: uuidv4(),
    title: "ДВП (2440х1220мм)",
    description: "Древесно-волокнистая плита. Используется для обшивки стен, полов, в качестве основы под напольные покрытия и в мебельной промышленности.",
    image: `/images/плиты/двп.webp`,
    mainCategory: "Древесные плиты",
    subCategory: "ДВП",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "3мм": 210,
      "5мм": 500
    },
    urlId: "dvp"
  },
  {
    id: uuidv4(),
    title: "Фанера (1520х1520мм)",
    description: "Фанера высокого качества, используется в строительстве, ремонте и мебельном производстве. Выдерживает высокие нагрузки и влажность (в зависимости от сорта и вида).",
    image: `/images/плиты/фанера.webp`,
    mainCategory: "Древесные плиты",
    subCategory: "Фанера",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "4мм": 600,
      "6мм": 800,
      "8мм": 950,
      "10мм": 1100,
      "12мм": 1300,
      "15мм": 1500
    },
    urlId: "fanera"
  },
  {
    id: uuidv4(),
    title: "Вагонка класс AB",
    description: "Обшивочная доска из натурального дерева, отсортированная по качеству. Используется для внутренней отделки стен и потолков.",
    image: `/images/брус/вагонка.webp`,
    mainCategory: "Вагонка и бруски",
    subCategory: "Вагонка",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 140,
      "2.5м": 175,
      "2.7м": 190,
      "3м": 210
    },
    urlId: "vagonka-klass-ab"
  },
  {
    id: uuidv4(),
    title: "Деревянный брус (3000мм)",
    description: "Деревянный брус разных сечений. Используется в строительстве каркасов, обрешетки, мебели и временных конструкций.",
    image: `/images/брус/бруски.webp`,
    mainCategory: "Вагонка и бруски",
    subCategory: "Бруски",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "50х50мм": 220,
      "50х40мм": 200,
      "50х25мм": 140,
      "40х30мм (строганный)": 150,
      "40х20мм": 100
    },
    urlId: "derevyannyy-brus"
  },
  {
    id: uuidv4(),
    title: "Гипсокартон (2500х1200мм)",
    description: "Гипсокартонный лист для сухих помещений. Применяется для выравнивания стен и потолков, устройства перегородок и ниш.",
    image: `/images/гкл/гкл1.webp`,
    mainCategory: "Гипсокартон",
    subCategory: "Для сухих помещений",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "9.5мм": 280,
      "12.5мм": 310
    },
    urlId: "gipsokarton"
  },
  {
    id: uuidv4(),
    title: "Гипсокартон Knauf (12.5х3000х1200мм)",
    description: "Гипсокартон от бренда Knauf для сухих помещений. Отличается высоким качеством и точными геометрическими размерами.",
    image: `/images/гкл/кнауф.webp`,
    mainCategory: "Гипсокартон",
    subCategory: "Для сухих помещений",
    price: 500,
    urlId: "gipsokarton-knauf"
  },
  {
    id: uuidv4(),
    title: "Гипсокартон влагостойкий (2500х1200мм)",
    description: "Гипсокартон с добавками, повышающими устойчивость к влаге. Используется в помещениях с повышенной влажностью (ванная, кухня).",
    image: `/images/гкл/гкл2.webp`,
    mainCategory: "Гипсокартон",
    subCategory: "Влагостойкий",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "9.5мм": 350,
      "12.5мм": 380
    },
    urlId: "gipsokarton-vlagostoykiy"
  },
  {
    id: uuidv4(),
    title: "Гипсокартон влагостойкий Vetonit (2000х1200мм)",
    description: "Влагостойкий гипсокартон для помещений с повышенной влажностью. Используется для выравнивания стен и потолков.",
    image: `/images/гкл/ветон.webp`,
    mainCategory: "Гипсокартон",
    subCategory: "Влагостойкий",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "12.5мм": 300,
      "15мм": 400
    },
    urlId: "gipsokarton-vlagostoykiy-vetonit"
  },
  {
    id: uuidv4(),
    title: "Профиль (60х27х3000мм)",
    description: "Стеновой профиль для каркасов под гипсокартон. Подходит для возведения перегородок и обрешетки стен.",
    image: `/images/профиля/6027.webp`,
    mainCategory: "Профиля и направляющие",
    subCategory: "Стеновые",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "0.4мм": 160,
      "0.45мм": 180,
      "0.55мм": 230,
      "0.6мм knauf": 380
    },
    urlId: "profil-60h27"
  },
  {
    id: uuidv4(),
    title: "Направляющий (27х28х3000мм)",
    description: "Направляющий профиль для каркасов. Используется вместе со стоечным профилем при монтаже перегородок и подвесных потолков.",
    image: `/images/профиля/2728.webp`,
    mainCategory: "Профиля и направляющие",
    subCategory: "Стеновые",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "0.4мм": 120,
      "0.45мм": 130,
      "0.55мм": 160,
      "0.6мм": 250
    },
    urlId: "napravlyayuschiy-27h28"
  },
  {
    id: uuidv4(),
    title: "Профиль (50х50х3000мм)",
    description: "Перегородочный профиль для усиленных каркасов. Применяется при возведении капитальных перегородок.",
    image: `/images/профиля/5050.webp`,
    mainCategory: "Профиля и направляющие",
    subCategory: "Перегородочные",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "0.55мм": 350,
      "0.6мм": 450
    },
    urlId: "profil-50h50"
  },
  {
    id: uuidv4(),
    title: "Направляющий (50х40х3000мм)",
    description: "Направляющий профиль для перегородок. Используется в паре с профилем 50х50 или 75х50.",
    image: `/images/профиля/5040.webp`,
    mainCategory: "Профиля и направляющие",
    subCategory: "Перегородочные",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "0.5мм": 220,
      "0.55мм": 300,
      "0.6мм": 400
    },
    urlId: "napravlyayuschiy-50h40"
  },
  {
    id: uuidv4(),
    title: "Профиль (75х50х3000мм)",
    description: "Усиленный перегородочный профиль для высоких и широких перегородок. Обеспечивает дополнительную жесткость конструкции.",
    image: `/images/профиля/7550.webp`,
    mainCategory: "Профиля и направляющие",
    subCategory: "Перегородочные",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "0.55мм": 350
    },
    urlId: "profil-75h50"
  },
  {
    id: uuidv4(),
    title: "Направляющий (75х40х3000мм)",
    description: "Направляющая для профиля 75х50. Обеспечивает надежную фиксацию каркаса.",
    image: `/images/профиля/7540.webp`,
    mainCategory: "Профиля и направляющие",
    subCategory: "Перегородочные",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "0.55мм": 300
    },
    urlId: "napravlyayuschiy-75h40"
  },
  {
    id: uuidv4(),
    title: "Профиль (100х50х3000мм)",
    description: "Усиленный профиль для широких перегородок и конструкций с повышенной нагрузкой.",
    image: `/images/профиля/10050.webp`,
    mainCategory: "Профиля и направляющие",
    subCategory: "Перегородочные",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "0.55мм": 400,
      "0.6мм": 450,
      "0.6мм knauf": 550
    },
    urlId: "profil-100h50"
  },
  {
    id: uuidv4(),
    title: "Направляющий (100х40х3000мм)",
    description: "Направляющая для профиля 100х50. Используется при монтаже широких перегородок.",
    image: `/images/профиля/10040.webp`,
    mainCategory: "Профиля и направляющие",
    subCategory: "Перегородочные",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "0.55мм": 390,
      "0.6мм": 400,
      "0.6мм knauf": 500
    },
    urlId: "napravlyayuschiy-100h40"
  },
  {
    id: uuidv4(),
    title: "Маячок (6х3000мм)",
    description: "Металлический маячок длиной 3 м, высотой профиля 6 мм. Используется как направляющая при оштукатуривании стен и выравнивании поверхностей с перепадами до 5 мм и более.",
    image: `/images/маяки/6.webp`,
    mainCategory: "Маяки и перфорированные углы",
    subCategory: "Маяки",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "0.3мм": 50,
      "0.4мм": 60,
      "0.5мм": 80,
      "knauf": 100
    },
    urlId: "mayachok-6"
  },
  {
    id: uuidv4(),
    title: "Маячок (10х3000мм)",
    description: "Металлический маячок длиной 3 м, высотой профиля 10 мм. Применяется при значительных перепадах поверхности (от 10 мм). Используется как опорная направляющая при штукатурных работах.",
    image: `/images/маяки/10.webp`,
    mainCategory: "Маяки и перфорированные углы",
    subCategory: "Маяки",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "0.3мм": 60,
      "0.4мм": 80,
      "0.5мм": 100,
      "knauf": 120
    },
    urlId: "mayachok-10"
  },
  {
    id: uuidv4(),
    title: "Угол перфорированный (20х20х3000мм)",
    description: "Металлический перфорированный уголок длиной 3 м, размером полок 20×20 мм. Используется для армирования углов при штукатурных работах, предотвращает растрескивание штукатурного слоя.",
    image: `/images/маяки/2020.webp`,
    mainCategory: "Маяки и перфорированные углы",
    subCategory: "Перфорированные углы",
    price: 70,
    urlId: "ugol-perforirovannyy"
  },
  {
    id: uuidv4(),
    title: "Угол перфорированный Knauf (25х25х3000мм)",
    description: "Перфорированный уголок длиной 3 м, размером полок 25×25 мм. Применяется для усиления наружных углов стен. Обеспечивает ровный угол и защиту от сколов при отделке.",
    image: `/images/маяки/2525.webp`,
    mainCategory: "Маяки и перфорированные углы",
    subCategory: "Перфорированные углы",
    price: 120,
    urlId: "ugol-perforirovannyy-knauf"
  },
  {
    id: uuidv4(),
    title: "Угол перфорированный пластиковый (20х20х3000мм)",
    description: "Пластиковый перфорированный уголок длиной 3 м, размером 20×20 мм. Используется для армирования и защиты углов при штукатурке и шпатлёвке. Легкий, не подвержен коррозии.",
    image: `/images/маяки/пласт.webp`,
    mainCategory: "Маяки и перфорированные углы",
    subCategory: "Перфорированные углы",
    price: 60,
    urlId: "ugol-perforirovannyy-plastikovyy"
  },
  {
    id: uuidv4(),
    title: "Маяк перфорированный пластиковый (6х3000мм)",
    description: "Пластиковый перфорированный маячок длиной 3 м, высотой 6 мм. Используется как направляющая при выравнивании стен, особенно в местах с небольшими перепадами. Легкий, не подвержен коррозии.",
    image: `/images/маяки/маякпл.webp`,
    mainCategory: "Маяки и перфорированные углы",
    subCategory: "Маяки",
    price: 60,
    urlId: "mayak-perforirovannyy-plastikovyy"
  },
  {
    id: uuidv4(),
    title: "Профтруба (15х15х1.5мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/1515.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 150,
      "3м": 225,
      "4м": 300,
      "6м": 450
    },
    urlId: "proftruba-15h15h1-5"
  },
  {
    id: uuidv4(),
    title: "Профтруба (20х20х2мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/2020.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 200,
      "3м": 300,
      "4м": 400,
      "6м": 600
    },
    urlId: "proftruba-20h20h2"
  },
  {
    id: uuidv4(),
    title: "Профтруба (25х25х2мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/2525.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 250,
      "3м": 375,
      "4м": 500,
      "6м": 750
    },
    urlId: "proftruba-25h25h2"
  },
  {
    id: uuidv4(),
    title: "Профтруба (30х30х2мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/3030.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 300,
      "3м": 450,
      "4м": 600,
      "6м": 900
    },
    urlId: "proftruba-30h30h2"
  },
  {
    id: uuidv4(),
    title: "Профтруба (40х20х1.5мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/4020.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 250,
      "3м": 375,
      "4м": 500,
      "6м": 750
    },
    urlId: "proftruba-40h20h1-5"
  },
  {
    id: uuidv4(),
    title: "Профтруба (40х20х2мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/4020.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 280,
      "3м": 420,
      "4м": 640,
      "6м": 840
    },
    urlId: "proftruba-40h20h2"
  },
  {
    id: uuidv4(),
    title: "Профтруба (40х25х2мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/4025.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 300,
      "3м": 450,
      "4м": 600,
      "6м": 900
    },
    urlId: "proftruba-40h25h2"
  },
  {
    id: uuidv4(),
    title: "Профтруба (40х40х2мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/4040.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 380,
      "3м": 570,
      "4м": 760,
      "6м": 1140
    },
    urlId: "proftruba-40h40h2"
  },
  {
    id: uuidv4(),
    title: "Профтруба (50х25х2мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/5025.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 350,
      "3м": 525,
      "4м": 700,
      "6м": 1050
    },
    urlId: "proftruba-50h25h2"
  },
  {
    id: uuidv4(),
    title: "Профтруба (50х50х2мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/5050.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 450,
      "3м": 675,
      "4м": 900,
      "6м": 1350
    },
    urlId: "proftruba-50h50h2"
  },
  {
    id: uuidv4(),
    title: "Профтруба (60х30х2мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/6030.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 430,
      "3м": 645,
      "4м": 860,
      "6м": 1290
    },
    urlId: "proftruba-60h30h2"
  },
  {
    id: uuidv4(),
    title: "Профтруба (60х40х2мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/6040.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 450,
      "3м": 675,
      "4м": 900,
      "6м": 1350
    },
    urlId: "proftruba-60h40h2"
  },
  {
    id: uuidv4(),
    title: "Профтруба (60х40х3мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/6040.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 630,
      "3м": 945,
      "4м": 1260,
      "6м": 1890
    },
    urlId: "proftruba-60h40h3"
  },
  {
    id: uuidv4(),
    title: "Профтруба (60х60х2мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/6060.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 530,
      "3м": 795,
      "4м": 1060,
      "6м": 1590
    },
    urlId: "proftruba-60h60h2"
  },
  {
    id: uuidv4(),
    title: "Профтруба (60х60х3мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/6060.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 780,
      "3м": 1170,
      "4м": 1560,
      "6м": 2340
    },
    urlId: "proftruba-60h60h3"
  },
  {
    id: uuidv4(),
    title: "Профтруба (80х40х2мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/8040.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 610,
      "3м": 915,
      "4м": 1220,
      "6м": 1830
    },
    urlId: "proftruba-80h40h2"
  },
  {
    id: uuidv4(),
    title: "Профтруба (80х80х2мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/8080.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 730,
      "3м": 1095,
      "4м": 1460,
      "6м": 2190
    },
    urlId: "proftruba-80h80h2"
  },
  {
    id: uuidv4(),
    title: "Профтруба (80х80х3мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/8080.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 930,
      "3м": 1395,
      "4м": 1860,
      "6м": 2790
    },
    urlId: "proftruba-80h80h3"
  },
  {
    id: uuidv4(),
    title: "Профтруба (100х100х3мм)",
    description: "Стальная профильная труба с прямоугольным или квадратным сечением. Используется для строительства каркасов, заборов, ограждений, мебели и других металлических конструкций. Длина — 6 м. Также возможен раскрой на меньшие размеры.",
    image: `/images/профтрубы/100100.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Профтрубы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 1270,
      "3м": 1905,
      "4м": 2540,
      "6м": 3810
    },
    urlId: "proftruba-100h100h3"
  },
  {
    id: uuidv4(),
    title: "Угол металлический (32х32мм)",
    description: "Стальной уголок равнополочный или неравнополочный. Используется в строительстве, машиностроении и для усиления конструкций. Обеспечивает жесткость и устойчивость каркасов. Длина — 6 м.",
    image: `/images/профтрубы/угол3232.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Металлические углы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 470,
      "3м": 705,
      "4м": 940,
      "6м": 1410
    },
    urlId: "ugol-metallicheskiy-32h32"
  },
  {
    id: uuidv4(),
    title: "Угол металлический (40х40мм)",
    description: "Стальной уголок равнополочный или неравнополочный. Используется в строительстве, машиностроении и для усиления конструкций. Обеспечивает жесткость и устойчивость каркасов. Длина — 6 м.",
    image: `/images/профтрубы/угол4040.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Металлические углы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 530,
      "3м": 795,
      "4м": 1060,
      "6м": 1590
    },
    urlId: "ugol-metallicheskiy-40h40"
  },
  {
    id: uuidv4(),
    title: "Угол металлический (50х40мм)",
    description: "Стальной уголок равнополочный или неравнополочный. Используется в строительстве, машиностроении и для усиления конструкций. Обеспечивает жесткость и устойчивость каркасов. Длина — 6 м.",
    image: `/images/профтрубы/угол5040.webp`,
    mainCategory: "Профтрубы и металлические углы",
    subCategory: "Металлические углы",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "2м": 630,
      "3м": 945,
      "4м": 1260,
      "6м": 1890
    },
    urlId: "ugol-metallicheskiy-50h40"
  },
  {
    id: uuidv4(),
    title: "Стеклопластиковая арматура (бухта 50м)",
    description: "Композитная стеклопластиковая арматура — современная замена металлической. Обладает высокой прочностью на растяжение, в 2 раза превышающей стальную, при этом в 5–6 раз легче. Не подвержена коррозии, устойчива к химическим воздействиям. Применяется в частном и промышленном строительстве.",
    image: `/images/арм/арм.webp`,
    mainCategory: "Арматура и кладочная сетка",
    subCategory: "Стеклопластиковая арматура",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "6мм": 600,
      "8мм": 800,
      "10мм": 1200,
      "12мм": 1550
    },
    urlId: "stekloplastikovaya-armatura"
  },
  {
    id: uuidv4(),
    title: "Кладочная сетка (2х1м)",
    description: "Кладочная сетка из металла используется для армирования кладки из газобетона, кирпича и других материалов. Повышает прочность конструкции и предотвращает растрескивание.",
    image: `/images/арм/сетка.webp`,
    mainCategory: "Арматура и кладочная сетка",
    subCategory: "Кладочная сетка",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "3мм": 150,
      "4мм": 250
    },
    urlId: "kladochnaya-setka"
  },
  {
    id: uuidv4(),
    title: "Пеноплэкс (50х1185х585мм) уп/7шт",
    description: "Экструдированный пенополистирол для утепления фундаментов, полов, стен и кровель. Обладает низким водопоглощением и высокой прочностью. Упаковка — 7 листов.",
    image: `/images/утепл/пенопл1.webp`,
    mainCategory: "Утеплители",
    subCategory: "Пенополистирол",
    price: 320,
    urlId: "penopleks-50"
  },
  {
    id: uuidv4(),
    title: "Пеноплэкс (30х1185х585мм) уп/13шт",
    description: "Утеплитель из экструдированного пенополистирола толщиной 30 мм. Применяется для теплоизоляции стен, полов и перекрытий. Упаковка — 13 листов.",
    image: `/images/утепл/пенопл2.webp`,
    mainCategory: "Утеплители",
    subCategory: "Пенополистирол",
    price: 220,
    urlId: "penopleks-30"
  },
  {
    id: uuidv4(),
    title: "Пеноплэкс (20х1185х585мм) уп/20шт",
    description: "Тонкий утеплитель из экструдированного пенополистирола. Используется для дополнительного утепления и выравнивания поверхностей. Упаковка — 20 листов.",
    image: `/images/утепл/пенопл3.webp`,
    mainCategory: "Утеплители",
    subCategory: "Пенополистирол",
    price: 160,
    urlId: "penopleks-20"
  },
  {
    id: uuidv4(),
    title: "Техноплeкс (50х1185х585мм) уп/8шт",
    description: "Экструзионный пенополистирол от бренда Техноплекс. Высокая прочность и низкая теплопроводность. Подходит для утепления фундаментов, полов и стен. Упаковка — 8 листов.",
    image: `/images/утепл/технопл1.webp`,
    mainCategory: "Утеплители",
    subCategory: "Пенополистирол",
    price: 310,
    urlId: "tehnopleks-50"
  },
  {
    id: uuidv4(),
    title: "Техноплeкс (30х1185х585мм) уп/13шт",
    description: "Утеплитель Техноплекс толщиной 30 мм. Применяется в системах теплоизоляции жилых и коммерческих зданий. Упаковка — 13 листов.",
    image: `/images/утепл/технопл2.webp`,
    mainCategory: "Утеплители",
    subCategory: "Пенополистирол",
    price: 210,
    urlId: "tehnopleks-30"
  },
  {
    id: uuidv4(),
    title: "Техноплeкс (20х1185х585мм) уп/20шт",
    description: "Тонкий утеплитель Техноплекс для дополнительного слоя теплоизоляции. Используется в стенах, полах и кровлях. Упаковка — 20 листов.",
    image: `/images/утепл/технопл3.webp`,
    mainCategory: "Утеплители",
    subCategory: "Пенополистирол",
    price: 150,
    urlId: "tehnopleks-20"
  },
  {
    id: uuidv4(),
    title: "Профиплекс (50х1185х585мм) уп/8шт",
    description: "Экструдированный пенополистирол Profiplex для утепления фундаментов, цоколей, полов. Обладает низким водопоглощением и высокой прочностью. Упаковка — 8 листов.",
    image: `/images/утепл/профиплекс.webp`,
    mainCategory: "Утеплители",
    subCategory: "Пенополистирол",
    price: 310,
    urlId: "profipleks-50"
  },
  {
    id: uuidv4(),
    title: "Профиплекс (30х1185х585мм) уп/13шт",
    description: "Экструдированный пенополистирол Profiplex толщиной 30 мм. Подходит для теплоизоляции стен, полов, перекрытий. Упаковка — 13 листов.",
    image: `/images/утепл/профиплекс.webp`,
    mainCategory: "Утеплители",
    subCategory: "Пенополистирол",
    price: 210,
    urlId: "profipleks-30"
  },
  {
    id: uuidv4(),
    title: "Профиплекс (20х1185х585мм) уп/20шт",
    description: "Тонкий утеплитель Profiplex для дополнительного слоя теплоизоляции. Упаковка — 20 листов",
    image: `/images/утепл/профиплекс.webp`,
    mainCategory: "Утеплители",
    subCategory: "Пенополистирол",
    price: 150,
    urlId: "profipleks-20"
  },
  {
    id: uuidv4(),
    title: "Пенопласт (1200х1000мм)",
    description: "Пенопласт для утепления стен, перекрытий и мансард. Самозатухающийся, легкий, доступный, прост в монтаже.",
    image: `/images/утепл/пенопласт.webp`,
    mainCategory: "Утеплители",
    subCategory: "Пенопласт",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "3мм": 100,
      "4мм": 130,
      "5мм": 150,
      "10мм": 280
    },
    urlId: "penoplast"
  },
  {
    id: uuidv4(),
    title: "Технониколь Роклайт (1200х600х50мм) уп/8шт",
    description: "Утеплитель из каменной ваты для утепления стен и перекрытий. Обладает хорошими тепло- и звукоизоляционными свойствами. Упаковка — 8 матов.",
    image: `/images/утепл/роклайт.webp`,
    mainCategory: "Утеплители",
    subCategory: "Каменная и минеральная вата",
    price: 1000,
    urlId: "tehnonikol-roklayt"
  },
  {
    id: uuidv4(),
    title: "Звукоизоляция АкустиКнауф (1230х610х50мм) уп/16шт",
    description: "Минераловатный утеплитель для звукоизоляции стен и перегородок. Обеспечивает комфортный акустический режим в помещениях. Упаковка — 16 плит.",
    image: `/images/утепл/акустик.webp`,
    mainCategory: "Утеплители",
    subCategory: "Каменная и минеральная вата",
    price: 2800,
    urlId: "zvukoizolyatsiya-akustiknauf"
  },
  {
    id: uuidv4(),
    title: "Тисма (1200x8300х50мм) 20м²",
    description: "Минераловатный утеплитель Тисма для теплоизоляции стен, кровель и перекрытий. Обладает высокими теплоизоляционными свойствами. В рулоне 2 мата общей площадью 20 м²",
    image: `/images/утепл/тисма.webp`,
    mainCategory: "Утеплители",
    subCategory: "Каменная и минеральная вата",
    price: 1700,
    urlId: "tisma-2-mata"
  },
  {
    id: uuidv4(),
    title: "Isover СТРОНГ (610х1000х50мм) уп/10шт 6.1м²",
    description: "Минераловатный утеплитель Isover СТРОНГ для теплоизоляции стен и перекрытий. Обладает высокой плотностью и теплоизоляционными свойствами. Упаковка — 10 плит на площадь 6.1 м².",
    image: `/images/утепл/стронг.webp`,
    mainCategory: "Утеплители",
    subCategory: "Каменная и минеральная вата",
    price: 1200,
    urlId: "isover-strong"
  },
  {
    id: uuidv4(),
    title: "Isover Теплый дом (610х1170х100мм) уп/7шт 5м²",
    description: "Минераловатный утеплитель для утепления наружных стен и перекрытий. Обладает высокими теплоизоляционными свойствами. Толщина - 100мм. Упаковка — 7 плит на площадь 5 м².",
    image: `/images/утепл/изовер.webp`,
    mainCategory: "Утеплители",
    subCategory: "Каменная и минеральная вата",
    price: 1500,
    urlId: "isover-teplyy-dom-100mm"
  },
  {
    id: uuidv4(),
    title: "Isover Теплый дом (610х1170х50мм) уп/14шт 10м²",
    description: "Минераловатный утеплитель для теплоизоляции стен и перекрытий. Упаковка — 14 плит на площадь 10 м².",
    image: `/images/утепл/изовер.webp`,
    mainCategory: "Утеплители",
    subCategory: "Каменная и минеральная вата",
    price: 1500,
    urlId: "isover-teplyy-dom-50mm"
  },
  {
    id: uuidv4(),
    title: "Isover Теплый дом (8200х610х50мм) 10м²",
    description: "Минераловатный утеплитель для утепления стен и перекрытий. В рулоне 2 мата общей площадью 10 м²",
    image: `/images/утепл/изовер10.webp`,
    mainCategory: "Утеплители",
    subCategory: "Каменная и минеральная вата",
    price: 1500,
    urlId: "isover-teplyy-dom-2-mata"
  },
  {
    id: uuidv4(),
    title: "Фольгированный утеплитель (1200х25000мм)",
    description: "Отражающий утеплитель с фольгированным слоем. Используется для тепло-, паро- и гидроизоляции в банях, саунах, системах отопления и кровле.",
    image: `/images/изол/фольга.webp`,
    mainCategory: "Изоляция",
    subCategory: "Отражающая теплоизоляция",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "2мм": 750,
      "3мм": 900,
      "5мм": 1300,
      "10мм (1200х15000мм)": 1300
    },
    urlId: "folgirovannyy-uteplitel"
  },
  {
    id: uuidv4(),
    title: "Теплоотражающая пароизоляция 35м²",
    description: "Фольгированный материал для тепло- и пароизоляции. Используется в системах утепления стен, полов, кровель и вентиляции.",
    image: `/images/изол/ф.webp`,
    mainCategory: "Изоляция",
    subCategory: "Отражающая теплоизоляция",
    price: 2500,
    urlId: "teplootrazhayuschaya-paroizolyatsiya"
  },
  {
    id: uuidv4(),
    title: "Мембрана B Пароизоляция",
    description: "Пароизоляционная пленка для защиты утеплителя и конструкций от проникновения водяного пара. Используется в стенах, перекрытиях и кровлях.",
    image: `/images/изол/б.webp`,
    mainCategory: "Изоляция",
    subCategory: "Пароизоляция",
    sizeText: "Площадь:",
    pricesBySize: {
      "30м²": 450,
      "70м²": 850
    },
    urlId: "membrana-b-paroizolyatsiya"
  },
  {
    id: uuidv4(),
    title: "Мембрана D Гидро-пароизоляция",
    description: "Паро- и гидроизоляционная пленка с повышенной плотностью. Защищает утеплитель от конденсата и атмосферной влаги.",
    image: `/images/изол/д.webp`,
    mainCategory: "Изоляция",
    subCategory: "Гидро-пароизоляция",
    sizeText: "Площадь:",
    pricesBySize: {
      "30м²": 700,
      "70м²": 1300
    },
    urlId: "membrana-d-gidro-paroizolyatsiya"
  },
  {
    id: uuidv4(),
    title: "Мембрана A 70м² Ветро-влагозащита",
    description: "Ветрозащитная мембрана для защиты утеплителя от ветра и атмосферной влаги. Применяется в вентилируемых фасадах и кровлях.",
    image: `/images/изол/а.webp`,
    mainCategory: "Изоляция",
    subCategory: "Ветро-влагозащита",
    price: 1200,
    urlId: "membrana-a-vetro-vlagozaschita"
  },
  {
    id: uuidv4(),
    title: "Тисма B 60м² Пароизоляция",
    description: "Пароизоляционная пленка для защиты утеплителя от пара и конденсата. Используется в системах утепления стен, полов и перекрытий.",
    image: `/images/изол/тисмаб.webp`,
    mainCategory: "Изоляция",
    subCategory: "Пароизоляция",
    price: 2000,
    urlId: "tisma-b-paroizolyatsiya"
  },
  {
    id: uuidv4(),
    title: "Тисма A 60м² Ветро-влагозащита",
    description: "Ветро- и влагозащитная мембрана для защиты утеплителя от ветра и атмосферной влаги. Подходит для фасадов и кровель.",
    image: `/images/изол/тисмаа.webp`,
    mainCategory: "Изоляция",
    subCategory: "Ветро-влагозащита",
    price: 3000,
    urlId: "tisma-a-vetro-vlagozaschita"
  },
  {
    id: uuidv4(),
    title: "Fiberon B 60м² Пароизоляция",
    description: "Пароизоляционная пленка для защиты утеплителя от пара и конденсата. Используется в стенах, перекрытиях и кровлях.",
    image: `/images/изол/фб.webp`,
    mainCategory: "Изоляция",
    subCategory: "Пароизоляция",
    price: 1200,
    urlId: "fiberon-b-paroizolyatsiya"
  },
  {
    id: uuidv4(),
    title: "Fiberon D 60м² Гидро-пароизоляция",
    description: "Гидро- и пароизоляционная пленка для защиты утеплителя от влаги и пара. Подходит для наружных и внутренних работ.",
    image: `/images/изол/фд.webp`,
    mainCategory: "Изоляция",
    subCategory: "Гидро-пароизоляция",
    price: 2000,
    urlId: "fiberon-d-gidro-paroizolyatsiya"
  },
  {
    id: uuidv4(),
    title: "Fiberon A 60м² Ветро-влагозащита",
    description: "Ветро- и влагозащитная мембрана для защиты утеплителя от ветра и атмосферной влаги.",
    image: `/images/изол/фа.webp`,
    mainCategory: "Изоляция",
    subCategory: "Ветро-влагозащита",
    price: 2000,
    urlId: "fiberon-a-vetro-vlagozaschita"
  },
  {
    id: uuidv4(),
    title: "Изоспан B Пароизоляция",
    description: "Пароизоляционная пленка для защиты утеплителя от пара и конденсата. Применяется в системах утепления стен, полов и кровель.",
    image: `/images/изол/изб.webp`,
    mainCategory: "Изоляция",
    subCategory: "Пароизоляция",
    sizeText: "Площадь:",
    pricesBySize: {
      "35м²": 1400,
      "70м²": 2500
    },
    urlId: "izospan-b-paroizolyatsiya"
  },
  {
    id: uuidv4(),
    title: "Изоспан D Гидро-пароизоляция",
    description: "Гидро- и пароизоляционная пленка с высокой прочностью. Защищает утеплитель от влаги и пара.",
    image: `/images/изол/изд.webp`,
    mainCategory: "Изоляция",
    subCategory: "Гидро-пароизоляция",
    sizeText: "Площадь:",
    pricesBySize: {
      "35м²": 1700,
      "70м²": 3000
    },
    urlId: "izospan-d-gidro-paroizolyatsiya"
  },
  {
    id: uuidv4(),
    title: "Изоспан AM Ветро-влагозащита 70м²",
    description: "Трёхслойная ветро- и влагозащитная мембрана для защиты утеплителя от ветра и влаги. Подходит для кровель и фасадов.",
    image: `/images/изол/изам.webp`,
    mainCategory: "Изоляция",
    subCategory: "Ветро-влагозащита",
    price: 5500,
    urlId: "izospan-am-vetro-vlagozaschita"
  },
  {
    id: uuidv4(),
    title: "Изоспан FB Гидро-пароизоляция отражающая 35м²",
    description: "Фольгированный материал с гидроизоляционными свойствами. Используется для утепления бань, саун, трубопроводов.",
    image: `/images/изол/изфб.webp`,
    mainCategory: "Изоляция",
    subCategory: "Гидро-пароизоляция",
    price: 2800,
    urlId: "izospan-fb-gidro-paroizolyatsiya-otrazhayuschaya"
  },
  {
    id: uuidv4(),
    title: "Гидроизоляция Ceresit CR65",
    description: "Гидроизоляционная смесь на цементной основе для защиты бетонных и кирпичных конструкций от воды и влаги. Применяется в бассейнах, ванных, душевых, на балконах и террасах. Обладает высокой эластичностью и адгезией.",
    image: `/images/гидроизол/ср65.webp`,
    mainCategory: "Гидроизоляция",
    subCategory: "Сухая смесь",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "5кг": 500,
      "20кг": 1300
    },
    urlId: "gidroizolyatsiya-ceresit-cr65"
  },
  {
    id: uuidv4(),
    title: "Гидроизоляция Литокс",
    description: "Однокомпонентная эластичная гидроизоляция на полимерной основе. Используется для защиты бетонных, кирпичных и газобетонных поверхностей от влаги. Подходит для ванных комнат, бассейнов, фундаментов.",
    image: `/images/гидроизол/литокс.webp`,
    mainCategory: "Гидроизоляция",
    subCategory: "Жидкая гидроизоляция",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "5кг": 1800,
      "10кг": 3800
    },
    urlId: "gidroizolyatsiya-litoks"
  },
  {
    id: uuidv4(),
    title: "Гидроизоляция Vetonit",
    description: "Жидкая гидроизоляция для защиты внутренних и наружных конструкций от влаги. Обладает высокой эластичностью и устойчивостью к перепадам температур. Применяется в ванных, на балконах, в системах тёплых полов.",
    image: `/images/гидроизол/ветон.webp`,
    mainCategory: "Гидроизоляция",
    subCategory: "Жидкая гидроизоляция",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "4кг": 2400,
      "8кг": 3500
    },
    urlId: "gidroizolyatsiya-vetonit"
  },
  {
    id: uuidv4(),
    title: "Гидроизоляция Ceresit CL51",
    description: "Эластичная гидроизоляционная мембрана на основе акрилатов. Образует водонепроницаемый слой на бетоне, цементных стяжках, гипсокартоне. Используется в душевых, ванных, на балконах и террасах.",
    image: `/images/гидроизол/сл51.webp`,
    mainCategory: "Гидроизоляция",
    subCategory: "Жидкая гидроизоляция",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "5кг": 2700,
      "15кг": 3500
    },
    urlId: "gidroizolyatsiya-ceresit-cl51"
  },
  {
    id: uuidv4(),
    title: "Лента гидроизоляционная Волма 10м²",
    description: "Самоклеящаяся гидроизоляционная лента для герметизации стыков, швов и примыканий. Используется в сочетании с обмазочной гидроизоляцией для усиления защиты от протечек.",
    image: `/images/гидроизол/волма.webp`,
    mainCategory: "Гидроизоляция",
    subCategory: "Лента гидроизоляционная",
    price: 1500,
    urlId: "lenta-gidroizolyatsionnaya-volma"
  },
  {
    id: uuidv4(),
    title: "Рубероид РПП-300",
    description: "Рулонный битумный материал для гидроизоляции фундаментов, кровель, полов в подвалах. Обладает высокой водонепроницаемостью и прочностью.",
    image: `/images/гидроизол/рубероид.webp`,
    mainCategory: "Гидроизоляция",
    subCategory: "Битумные рулоны",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "10м": 400,
      "15м": 550
    },
    urlId: "ruberoid-rpp-300"
  },
  {
    id: uuidv4(),
    title: "Гидроизол ТКП (1000х10000мм)",
    description: "Гидроизоляционный материал на основе битума. Используется для защиты фундаментов, цоколей, кровель.",
    image: `/images/гидроизол/ткп.webp`,
    mainCategory: "Гидроизоляция",
    subCategory: "Битумные рулоны",
    sizeText: "Выберите тип:",
    pricesBySize: {
      "с присыпкой": 1500,
      "без присыпки": 1500
    },
    urlId: "gidroizol-tkp"
  },
  {
    id: uuidv4(),
    title: "Саморез по дереву",
    description: "Острые саморезы с резьбой для крепления гипсокартона к деревянным основаниям. Обеспечивают надежную фиксацию без предварительного сверления.",
    image: `/images/крепеж/дер.webp`,
    mainCategory: "Крепёж",
    subCategory: "Саморезы для гипсокартона",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "25мм": 250,
      "35мм": 250,
      "41мм": 250,
      "45мм": 250,
      "51мм": 250,
      "55мм": 250,
      "61мм": 250,
      "65мм": 250,
      "70мм": 250,
      "75мм": 250,
      "90мм": 250,
      "102мм": 250,
      "120мм": 250
    },
    "isWeight": true,
    "quantityStep": 0.1,
    "minQuantity": 0.1,
    urlId: "samorez-po-derevu"
  },
  {
    id: uuidv4(),
    title: "Саморез по металлу",
    description: "Саморезы с острым наконечником для крепления гипсокартона к металлическим профилям. Имеют шаг резьбы, адаптированный под тонкостенные профили.",
    image: `/images/крепеж/мет.webp`,
    mainCategory: "Крепёж",
    subCategory: "Саморезы для гипсокартона",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "25мм": 250,
      "32мм": 250,
      "41мм": 250
    },
    "isWeight": true,
    "quantityStep": 0.1,
    "minQuantity": 0.1,
    urlId: "samorez-po-metallu"
  },
  {
    id: uuidv4(),
    title: "Саморез прессшайба острый",
    description: "Саморезы с прессшайбой для крепления гипсокартона к металлическим профилям. Ускоряют монтаж, предотвращают перекосы листа и повреждение бумаги.",
    image: `/images/крепеж/пр.webp`,
    mainCategory: "Крепёж",
    subCategory: "Саморезы для гипсокартона",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "13мм": 300,
      "16мм": 300,
      "19мм": 300,
      "29мм": 300,
      "35мм": 300,
      "41мм": 300
    },
    "isWeight": true,
    "quantityStep": 0.1,
    "minQuantity": 0.1,
    urlId: "samorez-pressshayba-ostryy"
  },
  {
    id: uuidv4(),
    title: "Саморез прессшайба со сверлом",
    description: "Саморезы с остриём в виде сверла для крепления гипсокартона без предварительного засверливания. Удобны при монтаже на металлический каркас.",
    image: `/images/крепеж/прсв.webp`,
    mainCategory: "Крепёж",
    subCategory: "Саморезы для гипсокартона",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "13мм": 300,
      "16мм": 300,
      "19мм": 300,
      "29мм": 300,
      "35мм": 300
    },
    "isWeight": true,
    "quantityStep": 0.1,
    "minQuantity": 0.1,
    urlId: "samorez-pressshayba-so-sverlom"
  },
  {
    id: uuidv4(),
    title: "Кровельный саморез оцинкованный",
    description: "Высокопрочные оцинкованные саморезы для крепления металлочерепицы, профнастила и других кровельных материалов к деревянной обрешетке.",
    image: `/images/крепеж/кров/оцинк.webp`,
    mainCategory: "Крепёж",
    subCategory: "Кровельные саморезы",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "5.5х19мм": 2.5,
      "4.8х29мм": 2.5,
      "6.3х32мм": 4.5,
      "5.5х38мм": 3.5,
      "5.5х51мм": 4,
      "6.3х51мм": 4.5,
      "5.5х76мм": 5.5
    },
    urlId: "krovelnyy-samorez-otsinkovannyy"
  },
  {
    id: uuidv4(),
    title: "Кровельный саморез белый",
    description: "Цветные саморезы с полимерным покрытием для крепления кровельных материалов. Белый цвет позволяет вписать крепёж в светлую кровлю.",
    image: `/images/крепеж/кров/бел.webp`,
    mainCategory: "Крепёж",
    subCategory: "Кровельные саморезы",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "5.5х19мм": 3.5,
      "4.8х29мм": 3.5,
      "4.8х35мм": 4,
      "4.8х51мм": 4.5,
      "5.5х76мм": 7
    },
    urlId: "krovelnyy-samorez-belyy"
  },
  {
    id: uuidv4(),
    title: "Кровельный саморез графит",
    description: "Цветные саморезы с полимерным покрытием в цвет графита. Подходят для кровель тёмных оттенков.",
    image: `/images/крепеж/кров/граф.webp`,
    mainCategory: "Крепёж",
    subCategory: "Кровельные саморезы",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "5.5х19мм": 3.5,
      "4.8х29мм": 3.5,
      "4.8х35мм": 4,
      "4.8х51мм": 4.5,
      "5.5х76мм": 7
    },
    urlId: "krovelnyy-samorez-grafit"
  },
  {
    id: uuidv4(),
    title: "Кровельный саморез зелёный",
    description: "Цветные саморезы для крепления профнастила и металлочерепицы. Зелёный цвет сочетается с кровлями в природных тонах.",
    image: `/images/крепеж/кров/зел.webp`,
    mainCategory: "Крепёж",
    subCategory: "Кровельные саморезы",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "5.5х19мм": 3.5,
      "4.8х29мм": 3.5,
      "4.8х35мм": 4,
      "4.8х51мм": 4.5,
      "5.5х76мм": 7
    },
    urlId: "krovelnyy-samorez-zelenyy"
  },
  {
    id: uuidv4(),
    title: "Кровельный саморез коричневый",
    description: "Полимерные саморезы в тёплых тонах. Подходят для кровель в бежевых, кирпичных и земляных оттенках.",
    image: `/images/крепеж/кров/корич.webp`,
    mainCategory: "Крепёж",
    subCategory: "Кровельные саморезы",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "5.5х19мм": 3.5,
      "4.8х29мм": 3.5,
      "4.8х35мм": 4,
      "4.8х51мм": 4.5,
      "5.5х76мм": 7
    },
    urlId: "krovelnyy-samorez-korichnevyy"
  },
  {
    id: uuidv4(),
    title: "Кровельный саморез красный",
    description: "Цветные саморезы для крепления кровельных материалов. Красный цвет подходит для кровель в кирпичных и терракотовых оттенках.",
    image: `/images/крепеж/кров/крас.webp`,
    mainCategory: "Крепёж",
    subCategory: "Кровельные саморезы",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "5.5х19мм": 3.5,
      "4.8х29мм": 3.5,
      "4.8х35мм": 4,
      "4.8х51мм": 4.5,
      "5.5х76мм": 7
    },
    urlId: "krovelnyy-samorez-krasnyy"
  },
  {
    id: uuidv4(),
    title: "Кровельный саморез синий",
    description: "Саморезы с синим полимерным покрытием. Используются в кровлях холодных оттенков или для декоративного контраста.",
    image: `/images/крепеж/кров/син.webp`,
    mainCategory: "Крепёж",
    subCategory: "Кровельные саморезы",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "5.5х19мм": 3.5,
      "4.8х29мм": 3.5,
      "4.8х35мм": 4,
      "4.8х51мм": 4.5,
      "5.5х76мм": 7
    },
    urlId: "krovelnyy-samorez-siniy"
  },
  {
    id: uuidv4(),
    title: "Кровельный саморез слоновая кость",
    description: "Саморезы в светло-бежевом оттенке. Подходят для светлых и бежевых кровель, в том числе под натуральную черепицу.",
    image: `/images/крепеж/кров/слон.webp`,
    mainCategory: "Крепёж",
    subCategory: "Кровельные саморезы",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "5.5х19мм": 3.5,
      "4.8х29мм": 3.5,
      "4.8х35мм": 4,
      "4.8х51мм": 4.5,
      "5.5х76мм": 7
    },
    urlId: "krovelnyy-samorez-slonovaya-kost"
  },
  {
    id: uuidv4(),
    title: "Саморез прессшайба коричневый (19мм)",
    description: "Саморез с прессшайбой и полимерным покрытием в коричневом цвете. Подходит для кровельных работ, особенно на черепице и профнастиле в теплых тонах.",
    image: `/images/крепеж/кров/краш1.webp`,
    mainCategory: "Крепёж",
    subCategory: "Кровельные саморезы",
    price: 2,
    urlId: "samorez-pressshayba-korichnevyy"
  },
  {
    id: uuidv4(),
    title: "Саморез прессшайба белый (19мм)",
    description: "Саморез с прессшайбой в белом цвете. Используется для крепления кровельных материалов к деревянной обрешетке.",
    image: `/images/крепеж/кров/краш2.webp`,
    mainCategory: "Крепёж",
    subCategory: "Кровельные саморезы",
    price: 2,
    urlId: "samorez-pressshayba-belyy"
  },
  {
    id: uuidv4(),
    title: "Саморез прессшайба графит (19мм)",
    description: "Цветной саморез с прессшайбой в цвет графита. Подходит для тёмных и холодных оттенков кровельных материалов.",
    image: `/images/крепеж/кров/краш3.webp`,
    mainCategory: "Крепёж",
    subCategory: "Кровельные саморезы",
    price: 2,
    urlId: "samorez-pressshayba-grafit"
  },
  {
    id: uuidv4(),
    title: "Гвозди",
    description: "Стандартные стальные гвозди для общестроительных работ. Применяются в деревянном домостроении, монтаже опалубки, обрешетки и других задачах.",
    image: `/images/крепеж/гвозди/гвозди.webp`,
    mainCategory: "Крепёж",
    subCategory: "Гвозди",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "20мм": 200,
      "40мм": 200,
      "50мм": 200,
      "60мм": 200,
      "70мм": 200,
      "80мм": 200,
      "90мм": 200,
      "100мм": 200,
      "110мм": 200,
      "120мм": 200,
      "150мм": 200
    },
    "isWeight": true,
    "quantityStep": 0.1,
    "minQuantity": 0.1,
    urlId: "gvozdi"
  },
  {
    id: uuidv4(),
    title: "Гвозди толевые",
    description: "Гвозди с крупной шляпкой для крепления толя, рубероида и других рулонных гидроизоляционных материалов.",
    image: `/images/крепеж/гвозди/тол.webp`,
    mainCategory: "Крепёж",
    subCategory: "Гвозди",
    price: 300,
    "isWeight": true,
    "quantityStep": 0.1,
    "minQuantity": 0.1,
    urlId: "gvozdi-tolevye"
  },
  {
    id: uuidv4(),
    title: "Гвозди шиферные (120мм)",
    description: "Удлинённые гвозди с широкой шляпкой для крепления шифера к деревянной обрешетке. Обеспечивают надёжную фиксацию и защиту от вырывания.",
    image: `/images/крепеж/гвозди/шиф.webp`,
    mainCategory: "Крепёж",
    subCategory: "Гвозди",
    price: 300,
    "isWeight": true,
    "quantityStep": 0.1,
    "minQuantity": 0.1,
    urlId: "gvozdi-shifernye"
  },
  {
    id: uuidv4(),
    title: "Гвозди финишные латунь",
    description: "Финишные гвозди из латуни с декоративной шляпкой. Используются в столярных работах, при отделке мебели и интерьера.",
    image: `/images/крепеж/гвозди/латунь.webp`,
    mainCategory: "Крепёж",
    subCategory: "Гвозди",
    price: 800,
    "isWeight": true,
    "quantityStep": 0.1,
    "minQuantity": 0.1,
    urlId: "gvozdi-finishnye-latun"
  },
  {
    id: uuidv4(),
    title: "Гвозди финишные оцинкованные",
    description: "Финишные гвозди с оцинкованным покрытием для крепления деревянных изделий. Устойчивы к коррозии и подходят для помещений с повышенной влажностью.",
    image: `/images/крепеж/гвозди/оцинк.webp`,
    mainCategory: "Крепёж",
    subCategory: "Гвозди",
    price: 400,
    "isWeight": true,
    "quantityStep": 0.1,
    "minQuantity": 0.1,
    urlId: "gvozdi-finishnye-otsinkovannye"
  },
  {
    id: uuidv4(),
    title: "Анкерный болт",
    description: "Распорный анкерный болт для крепления тяжелых конструкций к бетону, кирпичу и камню. Используется для монтажа перил, навесов, кронштейнов и т. д.",
    image: `/images/крепеж/болты/анкер.webp`,
    mainCategory: "Крепёж",
    subCategory: "Болты, гайки",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "8х40мм": 10,
      "8х65мм": 13,
      "8х100мм": 15,
      "8х120мм": 20,
      "10х77мм": 20,
      "10х97мм": 20,
      "10х130мм": 25,
      "12х99мм": 30,
      "12х129мм": 30,
      "12х150мм": 40,
      "12х250мм": 50,
      "12х300мм": 60
    },
    urlId: "ankernyy-bolt"
  },
  {
    id: uuidv4(),
    title: "Болт",
    description: "Стандартный болт с шестигранной головкой для соединения металлических и деревянных конструкций. Используется в строительстве, ремонте и монтаже.",
    image: `/images/крепеж/болты/болт.webp`,
    mainCategory: "Крепёж",
    subCategory: "Болты, гайки",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "6х20мм": 5,
      "6х50мм": 7,
      "8х30мм": 8,
      "10х30мм": 10,
      "10х50мм": 12,
      "10х80мм": 15,
      "12х40мм": 10,
      "12х60мм": 15,
      "12х100мм": 20
    },
    urlId: "bolt"
  },
  {
    id: uuidv4(),
    title: "Гайка",
    description: "Шестигранные гайки для соединения с болтами и шпильками. Используются в различных строительных и монтажных работах.",
    image: `/images/крепеж/болты/гайки.webp`,
    mainCategory: "Крепёж",
    subCategory: "Болты, гайки",
    sizeText: "Выберите диаметр:",
    pricesBySize: {
      "6мм": 2,
      "8мм": 4,
      "10мм": 6,
      "12мм": 8
    },
    urlId: "gayka"
  },
  {
    id: uuidv4(),
    title: "Уголок крепёжный",
    description: "Стальной уголок для усиления соединений в каркасных конструкциях. Используется при монтаже гипсокартона, обрешетки, перегородок и других строительных работах.",
    image: `/images/крепеж/уголки.webp`,
    mainCategory: "Крепёж",
    subCategory: "Крепёжные уголки и подвесы",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "20х40х40мм": 6,
      "30х30х30мм": 8,
      "40х40х30мм": 10,
      "40х40х40мм": 15,
      "40х50х50мм": 18,
      "40х80х80мм": 20,
      "50х40х40мм": 20,
      "50х80х80мм": 30,
      "60х60х60мм": 25
    },
    urlId: "ugolok-krepezhnyy"
  },
  {
    id: uuidv4(),
    title: "Уголок крепёжный усиленный",
    description: "Усиленный стальной уголок для ответственных соединений и конструкций. Обеспечивает повышенную жёсткость каркасов при монтаже перегородок и подвесных потолков.",
    image: `/images/крепеж/усил.webp`,
    mainCategory: "Крепёж",
    subCategory: "Крепёжные уголки и подвесы",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "50х50х35мм": 15,
      "70х70х40мм": 25,
      "70х70х55мм": 30,
      "90х90х40мм": 35,
      "90х90х65мм": 40
    },
    urlId: "ugolok-krepezhnyy-usilennyy"
  },
  {
    id: uuidv4(),
    title: "Подвес прямой для гипсокартона",
    description: "Прямой подвес для крепления стоечных профилей при монтаже перегородок и потолков. Упрощает выравнивание каркаса и обеспечивает прочное крепление.",
    image: `/images/крепеж/подвес.webp`,
    mainCategory: "Крепёж",
    subCategory: "Крепёжные уголки и подвесы",
    sizeText: "Выберите толщину:",
    pricesBySize: {
      "0.7мм": 10,
      "0.9мм": 15,
      "1мм knauf": 20
    },
    urlId: "podves-pryamoy-dlya-gipsokartona"
  },
  {
    id: uuidv4(),
    title: "Дюбель морковка",
    description: "Распорный дюбель для крепления в бетоне, кирпиче и пустотелых материалах. Используется с саморезами и шурупами.",
    image: `/images/крепеж/дюб/морковка.webp`,
    mainCategory: "Крепёж",
    subCategory: "Дюбеля",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "6х42мм": 1,
      "6х52мм": 1
    },
    urlId: "dyubel-morkovka"
  },
  {
    id: uuidv4(),
    title: "Дюбель гвоздь",
    description: "Комбинированный крепёж: дюбель + гвоздь. Применяется для фиксации теплоизоляции, пенополистирола, профилей и других материалов.",
    image: `/images/крепеж/дюб/дюбель.webp`,
    mainCategory: "Крепёж",
    subCategory: "Дюбеля",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "6х40мм": 2,
      "6х60мм": 2.5,
      "6х80мм": 3.5,
      "8х60мм": 4,
      "8х120мм": 6
    },
    urlId: "dyubel-gvozd"
  },
  {
    id: uuidv4(),
    title: "Дюбель ввёртыш (15х38мм)",
    description: "Самонарезающий дюбель для крепления в пустотелые и пористые материалы (газобетон, пеноблок, пустотелый кирпич).",
    image: `/images/крепеж/дюб/ввертыш.webp`,
    mainCategory: "Крепёж",
    subCategory: "Дюбеля",
    price: 2,
    urlId: "dyubel-vvertysh"
  },
  {
    id: uuidv4(),
    title: "Дюбель бабочка",
    description: "Дюбель-бабочка для крепления в пустотелые материалы. Раскрывается внутри стены при закручивании шурупа.",
    image: `/images/крепеж/дюб/бабочка.webp`,
    mainCategory: "Крепёж",
    subCategory: "Дюбеля",
    price: 3,
    urlId: "dyubel-babochka"
  },
  {
    id: uuidv4(),
    title: "Удлинитель профилей (60х27мм)",
    description: "Соединительный элемент для наращивания профилей при монтаже каркасов. Обеспечивает прочное и ровное соединение.",
    image: `/images/крепеж/проф/удл.webp`,
    mainCategory: "Крепёж",
    subCategory: "Удлинитель профилей и крабы",
    price: 25,
    urlId: "udlinitel-profiley"
  },
  {
    id: uuidv4(),
    title: "Соединитель профилей Knauf (Краб)",
    description: "Крестовой соединитель (краб) для стоечных и направляющих профилей. Используется при монтаже каркасов для гипсокартона.",
    image: `/images/крепеж/проф/крабы.webp`,
    mainCategory: "Крепёж",
    subCategory: "Удлинитель профилей и крабы",
    price: 70,
    urlId: "soedinitel-profiley-knauf"
  },
  {
    id: uuidv4(),
    title: "Грунтовка Arco Iris глубокого проникновения",
    description: "Грунтовка глубокого проникновения для подготовки оснований под отделку. Укрепляет поверхность, уменьшает пылеобразование, повышает адгезию штукатурки и шпатлёвки.",
    image: `/images/отделка/грунт/арко.webp`,
    mainCategory: "Отделка",
    subCategory: "Грунтовка",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "10л": 500,
      "5л": 300,
      "3л": 200
    },
    urlId: "gruntovka-arco-iris-glubokogo-proniknoveniya"
  },
  {
    id: uuidv4(),
    title: "Грунтовка Ceresit CT17",
    description: "Универсальная грунтовка для внутренних работ. Подходит для бетона, гипсокартона, штукатурки. Уменьшает впитывающую способность основания.",
    image: `/images/отделка/грунт/ст17.webp`,
    mainCategory: "Отделка",
    subCategory: "Грунтовка",
    price: 1200,
    urlId: "gruntovka-ceresit-ct17"
  },
  {
    id: uuidv4(),
    title: "Грунтовка Оптимист",
    description: "Грунт для подготовки основания перед штукатурными и шпатлёвочными работами. Улучшает сцепление материалов с поверхностью.",
    image: `/images/отделка/грунт/оптимист1.webp`,
    mainCategory: "Отделка",
    subCategory: "Грунтовка",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "10л": 850,
      "5л": 500
    },
    urlId: "gruntovka-optimist"
  },
  {
    id: uuidv4(),
    title: "Грунтовка Оптимист глубокого проникновения",
    description: "Грунтовка с глубоким проникновением для укрепления пористых оснований. Уменьшает пыление, повышает адгезию.",
    image: `/images/отделка/грунт/оптимист2.webp`,
    mainCategory: "Отделка",
    subCategory: "Грунтовка",
    price: 1100,
    urlId: "gruntovka-optimist-glubokogo-proniknoveniya"
  },
  {
    id: uuidv4(),
    title: "Грунтовка Vetonit глубокого проникновения",
    description: "Грунт для укрепления основания и повышения адгезии. Подходит для бетона, кирпича, газобетона.",
    image: `/images/отделка/грунт/ветонит.webp`,
    mainCategory: "Отделка",
    subCategory: "Грунтовка",
    price: 1200,
    urlId: "gruntovka-vetonit-glubokogo-proniknoveniya"
  },
  {
    id: uuidv4(),
    title: "Грунтовка Knauf Тифенгрунд",
    description: "Готовая к применению грунтовка на акриловой основе для подготовки оснований перед отделкой. Используется для выравнивания впитывающей способности поверхностей (бетон, штукатурка, гипсокартон и др.), повышает адгезию к штукатуркам, шпатлёвкам и клеевым смесям. Не требует разведения.",
    image: `/images/отделка/грунт/тифен.webp`,
    mainCategory: "Отделка",
    subCategory: "Грунтовка",
    price: 1350,
    urlId: "gruntovka-knauf-tifengrund"
  },
  {
    id: uuidv4(),
    title: "Грунтовка Лакра интерьерная",
    description: "Грунт для подготовки внутренних поверхностей перед покраской, оклейкой обоев или нанесением штукатурки.",
    image: `/images/отделка/грунт/лакра.webp`,
    mainCategory: "Отделка",
    subCategory: "Грунтовка",
    price: 750,
    urlId: "gruntovka-lakra-interernaya"
  },
  {
    id: uuidv4(),
    title: "Грунт-концентрат Лакра PROFIT",
    description: "Концентрированная грунтовка для внутренних и наружных работ. Экономичный расход, высокая степень укрепления основания.",
    image: `/images/отделка/грунт/профит.webp`,
    mainCategory: "Отделка",
    subCategory: "Грунтовка",
    price: 1000,
    urlId: "grunt-kontsentrat-lakra-profit"
  },
  {
    id: uuidv4(),
    title: "Грунт-концентрат Arco Iris 1:10",
    description: "Концентрат грунтовки, разводится водой (1:10). Подходит для обработки пористых и впитывающих оснований.",
    image: `/images/отделка/грунт/конц.webp`,
    mainCategory: "Отделка",
    subCategory: "Грунтовка",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "10л": 1800,
      "5л": 1000,
      "3л": 650,
      "1л": 300
    },
    urlId: "grunt-kontsentrat-arco-iris-1-10"
  },
  {
    id: uuidv4(),
    title: "Грунт-концентрат Knauf Миттельгрунд",
    description: "Грунт для подготовки основания средней впитываемости (бетон, штукатурка, гипсокартон). Разводится водой в соотношении 1:3–1:5.",
    image: `/images/отделка/грунт/миттель.webp`,
    mainCategory: "Отделка",
    subCategory: "Грунтовка",
    price: 3300,
    urlId: "grunt-kontsentrat-knauf-mittelgrund"
  },
  {
    id: uuidv4(),
    title: "Грунтовка под декоративные штукатурки Ceresit CT16",
    description: "Специализированная грунтовка для подготовки основания перед нанесением декоративных штукатурок. Повышает адгезию и уменьшает впитываемость.",
    image: `/images/отделка/грунт/ст16.webp`,
    mainCategory: "Отделка",
    subCategory: "Грунтовка",
    price: 2500,
    urlId: "gruntovka-pod-dekorativnye-shtukaturki-ceresit-ct16"
  },
  {
    id: uuidv4(),
    title: "Бетоноконтакт Ceresit CT19 15кг",
    description: "Грунт с кварцевым наполнителем для высокой адгезии к гладким основаниям: бетону, цементным стяжкам, плитке.",
    image: `/images/отделка/грунт/ст19.webp`,
    mainCategory: "Отделка",
    subCategory: "Бетоноконтакт",
    price: 2100,
    urlId: "betonokontakt-ceresit-ct19-15kg"
  },
  {
    id: uuidv4(),
    title: "Бетоноконтакт Хабез 12кг",
    description: "Усиленная грунтовка с кварцевым песком для улучшения сцепления с гладкими основаниями. Применяется внутри и снаружи помещений.",
    image: `/images/отделка/грунт/хабез.webp`,
    mainCategory: "Отделка",
    subCategory: "Бетоноконтакт",
    price: 1000,
    urlId: "betonokontakt-habez-12kg"
  },
  {
    id: uuidv4(),
    title: "Бетоноконтакт Arco Iris",
    description: "Акриловый грунт с кварцевым наполнителем для повышения адгезии к трудноудерживаемым основаниям.",
    image: `/images/отделка/грунт/бконтакт.webp`,
    mainCategory: "Отделка",
    subCategory: "Бетоноконтакт",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "12кг": 1200,
      "6кг": 650,
      "3кг": 400,
      "1.5кг": 200
    },
    urlId: "betonokontakt-arco-iris"
  },
  {
    id: uuidv4(),
    title: "Краска Arco Iris для стен и потолков",
    description: "Водоэмульсионная краска для внутренних работ. Подходит для окрашивания штукатурки, бетона, гипсокартона. Обладает хорошей укрывистостью и легко наносится.",
    image: `/images/краски/стен.webp`,
    mainCategory: "Лакокрасочные материалы",
    subCategory: "Водоэмульсионные краски",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "14кг": 1300,
      "7кг": 700,
      "3кг": 350,
      "1.5кг": 230
    },
    urlId: "kraska-arco-iris-dlya-sten-i-potolkov"
  },
  {
    id: uuidv4(),
    title: "Краска Arco Iris моющаяся",
    description: "Моющаяся водоэмульсионная краска для стен и потолков. Устойчива к влажной уборке, подходит для кухонь, ванных и детских комнат.",
    image: `/images/краски/моющ.webp`,
    mainCategory: "Лакокрасочные материалы",
    subCategory: "Водоэмульсионные краски",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "14кг": 1500,
      "7кг": 800,
      "3кг": 450,
      "1.5кг": 260
    },
    urlId: "kraska-arco-iris-moyuschayasya"
  },
  {
    id: uuidv4(),
    title: "Краска Arco Iris фасадная",
    description: "Водоэмульсионная фасадная краска. Устойчива к перепадам температур, УФ-излучению и атмосферным осадкам. Подходит для наружных и внутренних работ.",
    image: `/images/краски/фасад.webp`,
    mainCategory: "Лакокрасочные материалы",
    subCategory: "Водоэмульсионные краски",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "14кг": 1600,
      "7кг": 900,
      "3кг": 450,
      "1.5кг": 300
    },
    urlId: "kraska-arco-iris-fasadnaya"
  },
  {
    id: uuidv4(),
    title: "Краска Лакра для стен и потолков",
    description: "Белая водоэмульсионная краска для внутренних работ. Используется для окрашивания штукатурки, бетона, гипсокартона. Обладает хорошей укрывистостью.",
    image: `/images/краски/лстен.webp`,
    mainCategory: "Лакокрасочные материалы",
    subCategory: "Водоэмульсионные краски",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "14кг": 1300,
      "6.5кг": 700,
      "3кг": 350,
      "1.5кг": 200
    },
    urlId: "kraska-lakra-dlya-sten-i-potolkov"
  },
  {
    id: uuidv4(),
    title: "Краска Лакра моющаяся",
    description: "Моющаяся водоэмульсионная краска для стен и потолков. Устойчива к многократной влажной уборке. Подходит для кухонь, ванных, коридоров.",
    image: `/images/краски/лмоющ.webp`,
    mainCategory: "Лакокрасочные материалы",
    subCategory: "Водоэмульсионные краски",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "14кг": 2500,
      "6.5кг": 1200,
      "3кг": 650
    },
    urlId: "kraska-lakra-moyuschayasya"
  },
  {
    id: uuidv4(),
    title: "Краска Лакра фасадная",
    description: "Фасадная водоэмульсионная краска с высокой стойкостью к влаге и УФ-излучению. Используется для наружных и внутренних работ.",
    image: `/images/краски/лфасад.webp`,
    mainCategory: "Лакокрасочные материалы",
    subCategory: "Водоэмульсионные краски",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "14кг": 2550,
      "6.5кг": 1250,
      "3кг": 650
    },
    urlId: "kraska-lakra-fasadnaya"
  },
  {
    id: uuidv4(),
    title: "Эмаль алкидная ПФ-115 (1.8кг)",
    description: "Универсальная алкидная эмаль для окрашивания металлических, деревянных и оштукатуренных поверхностей. Обладает высокой укрывистостью и долговечностью.",
    image: `/images/краски/пф.webp`,
    mainCategory: "Лакокрасочные материалы",
    subCategory: "Эмали",
    sizeText: "Выберите цвет:",
    pricesBySize: {
      "Чёрный": 400,
      "Белый": 400,
      "Серый": 400,
      "Графит": 400,
      "Шоколадный": 400,
      "Вишнёвый": 400,
      "Жёлтый": 400,
      "Голубой": 400,
      "Бирюзовый": 400,
      "Салатный": 400
    },
    urlId: "emal-alkidnaya-pf-115"
  },
  {
    id: uuidv4(),
    title: "Эмаль алкидная ПФ-115 (0.8кг)",
    description: "Универсальная алкидная эмаль для окрашивания металлических, деревянных и оштукатуренных поверхностей. Обладает высокой укрывистостью и долговечностью.",
    image: `/images/краски/пф.webp`,
    mainCategory: "Лакокрасочные материалы",
    subCategory: "Эмали",
    sizeText: "Выберите цвет:",
    pricesBySize: {
      "Чёрный": 200,
      "Белый": 200,
      "Серый": 200,
      "Графит": 200,
      "Жёлтый": 200,
      "Синий": 200
    },
    urlId: "emal-alkidnaya-pf-115"
  },
  {
    id: uuidv4(),
    title: "Грунт-эмаль 3в1 (1.8кг)",
    description: "Грунт-эмаль с антикоррозионными свойствами. Подходит для подготовки и окрашивания металлических поверхностей перед покраской.",
    image: `/images/краски/грунт.webp`,
    mainCategory: "Лакокрасочные материалы",
    subCategory: "Эмали",
    sizeText: "Выберите цвет:",
    pricesBySize: {
      "Чёрный": 500,
      "Белый": 500,
      "Серый": 500,
      "Графит": 500,
      "Шоколадный": 500
    },
    urlId: "grunt-emal-3v1"
  },
  {
    id: uuidv4(),
    title: "Грунт-эмаль 3в1 (0.8кг)",
    description: "Грунт-эмаль с антикоррозионными свойствами. Подходит для подготовки и окрашивания металлических поверхностей перед покраской.",
    image: `/images/краски/грунт.webp`,
    mainCategory: "Лакокрасочные материалы",
    subCategory: "Эмали",
    sizeText: "Выберите цвет:",
    pricesBySize: {
      "Чёрный": 300,
      "Белый": 300,
      "Серый": 300,
      "Графит": 300,
      "Шоколадный": 300
    },
    urlId: "grunt-emal-3v1"
  },
  {
    id: uuidv4(),
    title: "Эмаль для радиаторов акриловая",
    description: "Термостойкая акриловая эмаль для окрашивания отопительных радиаторов. Выдерживает температуру до 80°C.",
    image: `/images/краски/термо.webp`,
    mainCategory: "Лакокрасочные материалы",
    subCategory: "Эмали",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "0.9кг": 500,
      "1.9кг": 900
    },
    urlId: "emal-dlya-radiatorov-akrilovaya"
  },
  {
    id: uuidv4(),
    title: "Эмаль для дверей и подоконников акриловая",
    description: "Акриловая эмаль для окрашивания деревянных окон, дверей, подоконников. Образует прочное и износостойкое покрытие.",
    image: `/images/краски/окон.webp`,
    mainCategory: "Лакокрасочные материалы",
    subCategory: "Эмали",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "0.9кг": 500,
      "1.9кг": 900
    },
    urlId: "emal-dlya-dverey-i-podokonnikov-akrilovaya"
  },
  {
    id: uuidv4(),
    title: "Яхтный лак бесцветный",
    description: "Защитный лак для деревянных поверхностей внутри и снаружи помещений. Обладает высокой водостойкостью и устойчивостью к УФ-излучению.",
    image: `/images/краски/яхт.webp`,
    mainCategory: "Лакокрасочные материалы",
    subCategory: "Лаки и пропитки",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "0.9л": 400,
      "1.9л": 700
    },
    urlId: "yahtnyy-lak-bestsvetnyy"
  },
  {
    id: uuidv4(),
    title: "Пропитка Profiwood (0.75л)",
    description: "Масляно-алкидная пропитка для защиты и декора древесины. Подчеркивает текстуру дерева, защищает от влаги и выцветания. Подходит для террас, заборов, мебели и других поверхностей.",
    image: `/images/краски/профи075.webp`,
    mainCategory: "Лакокрасочные материалы",
    subCategory: "Лаки и пропитки",
    sizeText: "Выберите оттенок:",
    pricesBySize: {
      "Калужница": 400,
      "Красное дерево": 400,
      "Сосна": 400,
      "Палисандр": 400,
      "Тик": 400,
      "Орегон": 400
    },
    urlId: "propitka-profiwood"
  },
  {
    id: uuidv4(),
    title: "Пропитка Profiwood (2.5л)",
    description: "Масляно-алкидная пропитка для защиты и декора древесины. Подчеркивает текстуру дерева, защищает от влаги и выцветания. Подходит для террас, заборов, мебели и других поверхностей.",
    image: `/images/краски/профи25.webp`,
    mainCategory: "Лакокрасочные материалы",
    subCategory: "Лаки и пропитки",
    sizeText: "Выберите оттенок:",
    pricesBySize: {
      "Калужница": 1100,
      "Красное дерево": 1100,
      "Сосна": 1100,
      "Палисандр": 1100,
      "Тик": 1100,
      "Орегон": 1100
    },
    urlId: "propitka-profiwood"
  },
  {
    id: uuidv4(),
    title: "Шпатлёвка латексная Текс",
    description: "Готовая шпатлёвка на латексной основе для выравнивания поверхностей перед покраской или оклейкой обоев. Подходит для гипсокартона, штукатурки, бетона.",
    image: `/images/отделка/шпатлевки/текс.webp`,
    mainCategory: "Отделка",
    subCategory: "Готовые шпатлёвки",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "16кг": 1300,
      "8кг": 850,
      "5кг": 650,
      "1.5кг": 200
    },
    urlId: "shpatlevka-lateksnaya-teks"
  },
  {
    id: uuidv4(),
    title: "Шпатлёвка универсальная SHEETROCK SuperFinish",
    description: "Готовая шпатлёвка для заделки швов, трещин и неровностей. Обладает высокой пластичностью и удобна в нанесении.",
    image: `/images/отделка/шпатлевки/шитрок.webp`,
    mainCategory: "Отделка",
    subCategory: "Готовые шпатлёвки",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "28кг": 3500,
      "18кг": 2300
    },
    urlId: "shpatlevka-universalnaya-sheetrock-superfinish"
  },
  {
    id: uuidv4(),
    title: "Шпатлёвка финишная Knauf Ротбанд паста (18кг)",
    description: "Финишная шпатлёвка на основе полимеров. Используется для тонкого выравнивания стен и потолков перед покраской или поклейкой обоев.",
    image: `/images/отделка/шпатлевки/ротбанд.webp`,
    mainCategory: "Отделка",
    subCategory: "Готовые шпатлёвки",
    price: 2000,
    urlId: "shpatlevka-finishnaya-knauf-rotband-pasta"
  },
  {
    id: uuidv4(),
    title: "Шпатлёвка финишная Vetonit LR паста (18кг)",
    description: "Готовая акриловая шпатлёвка для внутренних работ. Обеспечивает гладкую поверхность перед покраской и оклейкой.",
    image: `/images/отделка/шпатлевки/лрпаста.webp`,
    mainCategory: "Отделка",
    subCategory: "Готовые шпатлёвки",
    price: 1700,
    urlId: "shpatlevka-finishnaya-vetonit-lr-pasta"
  },
  {
    id: uuidv4(),
    title: "Пена профессиональная 70л",
    description: "Высококачественная монтажная пена для профессионального использования. Обладает высокой адгезией, минимальной усадкой и увеличенным выходом.",
    image: `/images/отделка/пена/проф70.webp`,
    mainCategory: "Отделка",
    subCategory: "Монтажная пена и пена клей",
    pricesBySize: {
      "Arco Iris": 600,
      "Soudal": 600,
      "Tytan": 700,
      "Kudo": 600
    },
    urlId: "pena-professionalnaya-70l"
  },
  {
    id: uuidv4(),
    title: "Пена профессиональная 65л",
    description: "Профессиональная монтажная пена для плотных швов и высокой фиксации. Подходит для наружных и внутренних работ.",
    image: `/images/отделка/пена/проф65.webp`,
    mainCategory: "Отделка",
    subCategory: "Монтажная пена и пена клей",
    pricesBySize: {
      "Kron (универсальная)": 600,
      "Момент": 500,
      "Arco Iris": 500,
      "Kron": 500
    },
    urlId: "pena-professionalnaya-65l"
  },
  {
    id: uuidv4(),
    title: "Пена бытовая",
    description: "Монтажная пена для бытового использования. Обеспечивает надёжное заполнение швов, хорошее сцепление с большинством поверхностей.",
    image: `/images/отделка/пена/быт.webp`,
    mainCategory: "Отделка",
    subCategory: "Монтажная пена и пена клей",
    pricesBySize: {
      "Kron 65л": 500,
      "Arco Iris 55л": 450
    },
    urlId: "pena-bytovaya"
  },
  {
    id: uuidv4(),
    title: "Пена клей Arco Iris",
    description: "Универсальная пена-клей для фиксации и герметизации. Используется вместо крепежа при монтаже панелей, утеплителя, оконных откосов.",
    image: `/images/отделка/пена/пенакл.webp`,
    mainCategory: "Отделка",
    subCategory: "Монтажная пена и пена клей",
    price: 600,
    urlId: "pena-kley-arco-iris"
  },
  {
    id: uuidv4(),
    title: "Пена огнеупорная Kolt",
    description: "Огнестойкая монтажная пена для заполнения и герметизации швов в противопожарных конструкциях.",
    image: `/images/отделка/пена/огн.webp`,
    mainCategory: "Отделка",
    subCategory: "Монтажная пена и пена клей",
    price: 600,
    urlId: "pena-ogneupornaya-kolt"
  },
  {
    id: uuidv4(),
    title: "Пена цемент Rich",
    description: "Цементная пена для заполнения швов и пустот в условиях высокой влажности. Устойчива к воде и механическим нагрузкам.",
    image: `/images/отделка/пена/цем.webp`,
    mainCategory: "Отделка",
    subCategory: "Монтажная пена и пена клей",
    price: 600,
    urlId: "pena-tsement-rich"
  },
  {
    id: uuidv4(),
    title: "Очиститель для пены",
    description: "Средство для очистки пистолетов и удаления остатков монтажной пены до затвердевания.",
    image: `/images/отделка/пена/очиститель.webp`,
    mainCategory: "Отделка",
    subCategory: "Монтажная пена и пена клей",
    price: 200,
    urlId: "ochistitel-dlya-peny"
  },
  {
    id: uuidv4(),
    title: "Силиконовый герметик санитарный",
    description: "Герметик с противогрибковыми добавками для ванных комнат, кухонь, душевых. Обеспечивает водонепроницаемое и долговечное соединение.",
    image: `/images/отделка/клей/санит.webp`,
    mainCategory: "Отделка",
    subCategory: "Герметик",
    sizeText: "Выберите товар:",
    pricesBySize: {
      "Tytan прозрачный": 550,
      "Tytan белый": 550,
      "Момент белый": 500
    },
    urlId: "silikonovyy-germetik-sanitarnyy"
  },
  {
    id: uuidv4(),
    title: "Силиконовый герметик универсальный",
    description: "Универсальный герметик для внутренних и наружных работ. Используется для герметизации швов в окнах, дверях, вентиляции.",
    image: `/images/отделка/клей/унив.webp`,
    mainCategory: "Отделка",
    subCategory: "Герметик",
    sizeText: "Выберите товар:",
    pricesBySize: {
      "ISOBOX белый": 350,
      "Super Монтажник белый": 350
    },
    urlId: "silikonovyy-germetik-universalnyy"
  },
  {
    id: uuidv4(),
    title: "Силиконовый герметик Tytan для кровли",
    description: "Эластичный герметик для герметизации швов на кровле. Устойчив к перепадам температур, ультрафиолету и осадкам.",
    image: `/images/отделка/клей/кров.webp`,
    mainCategory: "Отделка",
    subCategory: "Герметик",
    sizeText: "Выберите цвет:",
    pricesBySize: {
      "Прозрачный": 400,
      "Белый": 400,
      "Чёрный": 400
    },
    urlId: "silikonovyy-germetik-tytan-dlya-krovli"
  },
  {
    id: uuidv4(),
    title: "Силиконовый герметик Vetonit цветной",
    description: "Цветной силиконовый герметик для декоративной отделки и герметизации швов. Используется в ванных, на кухнях и в интерьере.",
    image: `/images/отделка/клей/ветон.webp`,
    mainCategory: "Отделка",
    subCategory: "Герметик",
    sizeText: "Выберите цвет:",
    pricesBySize: {
      "Белый": 700,
      "Серый": 700,
      "Серебро": 700,
      "Гранит": 700,
      "Антрацит": 700
    },
    urlId: "silikonovyy-germetik-vetonit-tsvetnoy"
  },
  {
    id: uuidv4(),
    title: "Силиконовый герметик Rich огнеупорный",
    description: "Огнеупорный герметик для герметизации швов в условиях повышенной температуры. Подходит для каминов, печей, вентиляции.",
    image: `/images/отделка/клей/огнеуп.webp`,
    mainCategory: "Отделка",
    subCategory: "Герметик",
    price: 400,
    urlId: "silikonovyy-germetik-rich-ogneupornyy"
  },
  {
    id: uuidv4(),
    title: "Монтажный клей Момент Жидкие гвозди",
    description: "Высокопрочный клей для фиксации панелей, плит, зеркал, плинтусов и других материалов.",
    image: `/images/отделка/клей/мв.webp`,
    mainCategory: "Отделка",
    subCategory: "Клей",
    sizeText: "Выберите товар:",
    pricesBySize: {
      "МВ-100": 500,
      "МВ-70": 470,
      "МВ-50": 450
    },
    urlId: "montazhnyy-kley-moment-zhidkie-gvozdi"
  },
  {
    id: uuidv4(),
    title: "Монтажный клей Жидкие гвозди",
    description: "Универсальный клей для фиксации материалов без крепежа. Подходит для разных поверхностей: дерево, металл, пластик, бетон.",
    image: `/images/отделка/клей/клей.webp`,
    mainCategory: "Отделка",
    subCategory: "Клей",
    sizeText: "Выберите товар:",
    pricesBySize: {
      "Tytan Classic Fix": 800,
      "ЭКОН": 350,
      "Master Teks": 300
    },
    urlId: "montazhnyy-kley-zhidkie-gvozdi"
  },
  {
    id: uuidv4(),
    title: "Клей КС для линоулема",
    description: "Специализированный клей для приклеивания линолеума и других напольных покрытий. Обеспечивает прочное и долговечное сцепление.",
    image: `/images/отделка/клей/кс.webp`,
    mainCategory: "Отделка",
    subCategory: "Клей",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "5кг": 500,
      "2.7кг": 350,
      "1.5кг": 250
    },
    urlId: "kley-ks-dlya-linoulema"
  },
  {
    id: uuidv4(),
    title: "Клей ПВА строительный",
    description: "Универсальный клей на основе ПВА для склеивания древесины, бумаги, картона, гипсокартона, ткани и других материалов.",
    image: `/images/отделка/клей/пва.webp`,
    mainCategory: "Отделка",
    subCategory: "Клей",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "10кг": 900,
      "5кг": 450,
      "3кг": 300,
      "0.9кг": 150
    },
    urlId: "kley-pva-stroitelnyy"
  },
  {
    id: uuidv4(),
    title: "Клей Hauser для пенополистирола ",
    description: "Клей для приклеивания пенополистирола, пенопласта, гипсокартона, панелей. Образует прочное и устойчивое к влаге соединение.",
    image: `/images/отделка/клей/хаузер.webp`,
    mainCategory: "Отделка",
    subCategory: "Клей",
    price: 500,
    urlId: "kley-hauser-dlya-penopolistirola"
  },
  {
    id: uuidv4(),
    title: "Стеклосетка фасадная под штукатурку",
    description: "Армирующая стеклосетка для усиления фасадных и внутренних штукатурных систем. Увеличивает прочность и предотвращает растрескивание.",
    image: `/images/отделка/стекл/фасад.webp`,
    mainCategory: "Отделка",
    subCategory: "Стеклосетка и стеклохолст",
    sizeText: "Выберите стеклосетку:",
    pricesBySize: {
      "Зелёная 50м": 2200,
      "Жёлтая 50м": 1950,
      "Синяя 50м": 2000,
      "Жёлтая 30м": 1500,
      "Жёлтая 20м": 1100,
      "Жёлтая 10м": 700
    },
    urlId: "steklosetka-fasadnaya-pod-shtukaturku"
  },
  {
    id: uuidv4(),
    title: "Стеклосетка малярная под штукатурку",
    description: "Малярная сетка для армирования штукатурных систем, выравнивания углов, заделки трещин.",
    image: `/images/отделка/стекл/интер.webp`,
    mainCategory: "Отделка",
    subCategory: "Стеклосетка и стеклохолст",
    sizeText: "Выберите стеклосетку:",
    pricesBySize: {
      "5х5 50м": 1550,
      "5х5 20м": 800,
      "2х2 50м": 1400,
      "2х2 20м": 800,
      "2х2 10м": 500
    },
    urlId: "steklosetka-malyarnaya-pod-shtukaturku"
  },
  {
    id: uuidv4(),
    title: "Стеклохолст малярный (40гр/м²)",
    description: "Нетканый стеклохолст для армирования и выравнивания стен перед поклейкой обоев. Предотвращает растрескивание штукатурки.",
    image: `/images/отделка/стекл/холст.webp`,
    mainCategory: "Отделка",
    subCategory: "Стеклосетка и стеклохолст",
    price: 1800,
    urlId: "stekloholst-malyarnyy"
  },
  {
    id: uuidv4(),
    title: "Валик 180мм",
    description: "Валик шириной 180 мм для окрашивания стен и потолков. Подходит для водоэмульсионных и акриловых красок.",
    image: `/images/инструм/валики.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Валики",
    sizeText: "Выберите валик:",
    pricesBySize: {
      "Тигр (ворс 11мм)": 200,
      "Зелёный (ворс 18мм)": 200,
      "Полосатый (ворс 11мм)": 200
    },
    urlId: "valik-180mm"
  },
  {
    id: uuidv4(),
    title: "Валик 230мм",
    description: "Широкий валик для быстрого нанесения краски на большие поверхности. Используется с водоэмульсионными и акриловыми составами.",
    image: `/images/инструм/валики.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Валики",
    sizeText: "Выберите валик:",
    pricesBySize: {
      "Тигр (ворс 11мм)": 250,
      "Зелёный (ворс 18мм)": 250,
      "Полосатый (ворс 11мм)": 250
    },
    urlId: "valik-230mm"
  },
  {
    id: uuidv4(),
    title: "Шпатель",
    description: "Шпатель для нанесения и разравнивания шпатлёвки, клея, герметика.",
    image: `/images/инструм/шпатели.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Шпатели",
    sizeText: "Выберите ширину:",
    pricesBySize: {
      "40мм": 40,
      "60мм": 50,
      "80мм": 60,
      "100мм": 70,
      "150мм": 80,
      "200мм": 100,
      "250мм": 120,
      "300мм": 140,
      "350мм": 160,
      "450мм": 200,
      "600мм": 250
    },
    urlId: "shpatel"
  },
  {
    id: uuidv4(),
    title: "Шпатель профессиональный",
    description: "Профессиональный шпатель с усиленной конструкцией для точного нанесения шпатлёвочных смесей и клея.",
    image: `/images/инструм/проф.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Шпатели",
    sizeText: "Выберите ширину:",
    pricesBySize: {
      "63мм": 150,
      "75мм": 200,
      "100мм": 250,
      "120мм": 300,
      "150мм": 350,
      "200мм": 400,
      "250мм": 450,
      "300мм": 500,
      "350мм": 550
    },
    urlId: "shpatel-professionalnyy"
  },
  {
    id: uuidv4(),
    title: "Кисть с натуральной щетиной",
    description: "Кисть с натуральной щетиной для нанесения масляных и алкидных красок. Обеспечивает гладкое покрытие и точное нанесение.",
    image: `/images/инструм/кисти.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Кисти",
    sizeText: "Выберите ширину:",
    pricesBySize: {
      "20мм": 50,
      "25мм": 60,
      "40мм": 80,
      "50мм": 100,
      "65мм": 120,
      "75мм": 150,
      "100мм": 200
    },
    urlId: "kist-s-naturalnoy-schetinoy"
  },
  {
    id: uuidv4(),
    title: "Кисть с искусственной щетиной",
    description: "Кисть с синтетической щетиной для водоэмульсионных и акриловых красок. Не оставляет ворса, легко моется.",
    image: `/images/инструм/искус.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Кисти",
    sizeText: "Выберите ширину:",
    pricesBySize: {
      "38мм": 80,
      "50мм": 100,
      "65мм": 120,
      "75мм": 150,
      "100мм": 200
    },
    urlId: "kist-s-iskusstvennoy-schetinoy"
  },
  {
    id: uuidv4(),
    title: "Кисть макловица (ракля)",
    description: "Широкая кисть для быстрого нанесения грунтовки, краски, штукатурки. Удобна при работе на больших поверхностях.",
    image: `/images/инструм/ракля.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Кисти",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "140х50мм": 150,
      "150х70мм": 180,
      "170х70мм": 200
    },
    urlId: "kist-maklovitsa"
  },
  {
    id: uuidv4(),
    title: "Скотч 48мм",
    description: "Канцелярский и строительный скотч для фиксации, упаковки и защиты краёв при покраске.",
    image: `/images/инструм/скотчи.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Ленты и скотчи",
    sizeText: "Выберите длину:",
    pricesBySize: {
      "30м прозрачный": 100,
      "150м жёлтый": 300
    },
    urlId: "skotch-48mm"
  },
  {
    id: uuidv4(),
    title: "Лента малярная (48х5000мм)",
    description: "Малярный скотч для защиты поверхностей при покраске и отделке. Обеспечивает чёткую линию, легко отклеивается.",
    image: `/images/инструм/маляр.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Ленты и скотчи",
    price: 150,
    urlId: "lenta-malyarnaya"
  },
  {
    id: uuidv4(),
    title: "Пистолет для пены усиленный ПМ-220",
    description: "Усиленный монтажный пистолет для нанесения монтажной пены. Обладает прочной металлической конструкцией, регулировкой подачи и долгим сроком службы. Подходит для профессионального использования.",
    image: `/images/инструм/пм220.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Монтажные пистолеты",
    price: 650,
    urlId: "pistolet-dlya-peny-usilennyy-pm-220"
  },
  {
    id: uuidv4(),
    title: "Пистолет для пены металлический",
    description: "Прочный металлический пистолет для нанесения монтажной пены. Обеспечивает точную дозировку и равномерное распределение пены. Подходит для профессионального и бытового использования.",
    image: `/images/инструм/пистпен.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Монтажные пистолеты",
    price: 650,
    urlId: "pistolet-dlya-peny-metallicheskiy"
  },
  {
    id: uuidv4(),
    title: "Пистолет для пены Fomeron Fort",
    description: "Профессиональный пистолет для монтажной пены с регулировкой подачи и удобным ходом штока. Обеспечивает точное и экономичное нанесение пены.",
    image: `/images/инструм/фомеронт.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Монтажные пистолеты",
    price: 450,
    urlId: "pistolet-dlya-peny-fomeron-fort"
  },
  {
    id: uuidv4(),
    title: "Пистолет для пены пластиковый",
    description: "Бюджетный пистолет для нанесения монтажной пены. Удобен в бытовом использовании, подходит для стандартных баллонов.",
    image: `/images/инструм/пм02.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Монтажные пистолеты",
    price: 300,
    urlId: "pistolet-dlya-peny-plastikovyy"
  },
  {
    id: uuidv4(),
    title: "Пистолет для герметика полузакрытый",
    description: "Пистолет для нанесения силиконовых и акриловых герметиков из туб. Используется в строительстве, ремонте и автосервисе.",
    image: `/images/инструм/пистгерм.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Монтажные пистолеты",
    price: 350,
    urlId: "pistolet-dlya-germetika-poluzakrytyy"
  },
  {
    id: uuidv4(),
    title: "Зажим кольцо 500шт (1мм)",
    description: "Пластиковые зажимы (диски) для системы выравнивания плитки. Используются вместе с клиньями, чтобы равномерно распределить давление и выровнять уровень соседних плиток.",
    image: `/images/инструм/свп/роз500.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "СВП",
    price: 1000,
    urlId: "zazhim-koltso-500sht"
  },
  {
    id: uuidv4(),
    title: "Зажим кольцо 100шт (1мм)",
    description: "Пластиковые зажимы (диски) для системы выравнивания плитки. Используются вместе с клиньями, чтобы равномерно распределить давление и выровнять уровень соседних плиток.",
    image: `/images/инструм/свп/роз100.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "СВП",
    price: 300,
    urlId: "zazhim-koltso-100sht"
  },
  {
    id: uuidv4(),
    title: "Зажим кольцо 500шт (1.5мм)",
    description: "Пластиковые зажимы для СВП, предназначенные для более толстых плиток и крупноформатных элементов. Обеспечивают точное выравнивание и ровную поверхность.",
    image: `/images/инструм/свп/зел500.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "СВП",
    price: 1000,
    urlId: "zazhim-koltso-500sht"
  },
  {
    id: uuidv4(),
    title: "Зажим кольцо 100шт (1.5мм)",
    description: "Пластиковые зажимы для СВП, предназначенные для более толстых плиток и крупноформатных элементов. Обеспечивают точное выравнивание и ровную поверхность.",
    image: `/images/инструм/свп/зел100.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "СВП",
    price: 300,
    urlId: "zazhim-koltso-100sht"
  },
  {
    id: uuidv4(),
    title: "Клинья 200шт",
    description: "Пластиковые клинья для системы выравнивания плитки. Используются вместе с зажимами для точного выравнивания швов и поверхности. Удаляются после схватывания клея.",
    image: `/images/инструм/свп/клин200.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "СВП",
    price: 1000,
    urlId: "klinya-200sht"
  },
  {
    id: uuidv4(),
    title: "Клинья 50шт",
    description: "Пластиковые клинья для системы выравнивания плитки. Используются вместе с зажимами для точного выравнивания швов и поверхности. Удаляются после схватывания клея.",
    image: `/images/инструм/свп/клин50.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "СВП",
    price: 350,
    urlId: "klinya-50sht"
  },
  {
    id: uuidv4(),
    title: "Бита Ph2-50мм",
    description: "Универсальная бита с наконечником PH2 для работы с шуруповёртом. Подходит для завинчивания саморезов, шурупов и других крепёжных элементов. ",
    image: `/images/инструм/биты/бита.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Свёрла, биты и буры",
    price: 100,
    urlId: "bita-ph2-50mm"
  },
  {
    id: uuidv4(),
    title: "Бита кровельная 8мм",
    description: "Кровельная бита с широким наконечником для работы с кровельными саморезами. Обеспечивает надёжное закручивание без повреждения шляпки крепежа.",
    image: `/images/инструм/биты/кров.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Свёрла, биты и буры",
    price: 100,
    urlId: "bita-krovelnaya-8mm"
  },
  {
    id: uuidv4(),
    title: "Бур по бетону SDS+",
    description: "Бур с хвостовиком SDS+ для перфораторов. Используется для сверления отверстий в бетоне, кирпиче, камне.",
    image: `/images/инструм/биты/буры.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Свёрла, биты и буры",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "6х110мм": 120,
      "6х160мм": 150,
      "6х210мм": 180,
      "8х110мм": 140,
      "8х210мм": 200,
      "8х260мм": 220,
      "10х160мм": 200,
      "10х210мм": 220,
      "10х310мм": 250
    },
    urlId: "bur-po-betonu-sds"
  },
  {
    id: uuidv4(),
    title: "Сверло по металлу",
    description: "Свёрло из быстрорежущей стали HSS для точного сверления металлических заготовок, профилей, листового металла.",
    image: `/images/инструм/биты/сверла.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Свёрла, биты и буры",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "3мм": 50,
      "3.2мм": 60,
      "3.5мм": 70,
      "4.2мм": 80,
      "4.5мм": 90,
      "5мм": 100,
      "5.5мм": 110,
      "6мм": 130,
      "6.5мм": 140,
      "7мм": 150,
      "7.5мм": 170,
      "8.5мм": 200,
      "9мм": 230,
      "9.5мм": 250
    },
    urlId: "sverlo-po-metallu"
  },
  {
    id: uuidv4(),
    title: "Диск отрезной по металлу",
    description: "Абразивный отрезной диск для резки металлических профилей, арматуры, уголков и других изделий.",
    image: `/images/инструм/диски/отрез.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Абразивные диски",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "125мм": 100,
      "150мм": 120,
      "230мм": 150
    },
    urlId: "disk-otreznoy-po-metallu"
  },
  {
    id: uuidv4(),
    title: "Круг зачистной по металлу",
    description: "Зачистной диск для шлифовальных машин. Используется для удаления ржавчины, окалин, заусенцев и подготовки швов.",
    image: `/images/инструм/диски/зачист.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Абразивные диски",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "125х6х22мм": 150,
      "150х6х22мм": 170,
      "180х6х22мм": 200
    },
    urlId: "krug-zachistnoy-po-metallu"
  },
  {
    id: uuidv4(),
    title: "Шлифкруг лепестковый",
    description: "Лепестковый шлифовальный круг для финишной обработки металлических и деревянных поверхностей. Позволяет добиться гладкой поверхности.",
    image: `/images/инструм/диски/зачист.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Абразивные диски",
    price: 150,
    urlId: "shlifkrug-lepestkovyy"
  },
  {
    id: uuidv4(),
    title: "Диск алмазный ультратонкий (125мм)",
    description: "Алмазный отрезной диск для резки керамики, керамогранита, бетона и других твёрдых материалов. Ультратонкий для минимального скола и точной резки.",
    image: `/images/инструм/диски/ультра.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Абразивные диски",
    price: 500,
    urlId: "disk-almaznyy-ultratonkiy"
  },
  {
    id: uuidv4(),
    title: "Диск алмазный супертонкий (125мм)",
    description: "Супертонкий алмазный диск для резки керамической плитки, керамогранита и бетона. Обеспечивает чистый и аккуратный рез.",
    image: `/images/инструм/диски/ультра.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Абразивные диски",
    price: 450,
    urlId: "disk-almaznyy-supertonkiy"
  },
  {
    id: uuidv4(),
    title: "Диск алмазный по граниту LUFTER",
    description: "Профессиональный алмазный диск для резки гранита, мрамора, керамогранита и других твёрдых материалов.",
    image: `/images/инструм/диски/люфтер.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Абразивные диски",
    sizeText: "Выберите размер:",
    pricesBySize: {
      "115мм": 900,
      "125мм": 1000
    },
    urlId: "disk-almaznyy-po-granitu-lufter"
  },
  {
    id: uuidv4(),
    title: "Ведро строительное",
    description: "Пластиковое ведро для приготовления и переноски строительных смесей, воды, инструментов. Удобная форма и прочный материал выдерживают интенсивную эксплуатацию.",
    image: `/images/инструм/ведро.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Тара и ёмкости",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "12л": 150,
      "16л": 200,
      "20л": 250
    },
    urlId: "vedro-stroitelnoe"
  },
  {
    id: uuidv4(),
    title: "Таз строительный круглый",
    description: "Круглый пластиковый таз для замешивания штукатурки, клея, грунтовки и других смесей. Удобен для транспортировки и хранения материалов.",
    image: `/images/инструм/круг.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Тара и ёмкости",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "45л": 350,
      "60л": 400,
      "90л": 450
    },
    urlId: "taz-stroitelnyy-kruglyy"
  },
  {
    id: uuidv4(),
    title: "Таз строительный прямоугольный",
    description: "Прямоугольный таз для приготовления и переноски строительных смесей. Удобен для работы с клеем и штукатуркой.",
    image: `/images/инструм/прям.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Тара и ёмкости",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "45л": 350,
      "60л": 400,
      "90л": 450
    },
    urlId: "taz-stroitelnyy-pryamougolnyy"
  },
  {
    id: uuidv4(),
    title: "Ведро строительное ударопрочное Decor Profi (20л)",
    description: "Ударопрочное ведро из усиленного пластика. Устойчиво к деформации и нагрузкам. Подходит для профессионального использования.",
    image: `/images/инструм/удведр.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Тара и ёмкости",
    price: 700,
    urlId: "vedro-stroitelnoe-udaroprochnoe-decor-profi"
  },
  {
    id: uuidv4(),
    title: "Таз строительный ударопрочный Decor Profi",
    description: "Профессиональный таз из прочного пластика для работы с клеем, штукатуркой и другими смесями. Удобные ручки и устойчивость к повреждениям.",
    image: `/images/инструм/удтаз.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Тара и ёмкости",
    sizeText: "Выберите объём:",
    pricesBySize: {
      "30л": 1200,
      "50л": 1800
    },
    urlId: "taz-stroitelnyy-udaroprochnyy-decor-profi"
  },
  {
    id: uuidv4(),
    title: "Мешки для строительного мусора",
    description: "Прочные мешки для сбора и выноса строительного мусора. Выдерживают значительный вес, устойчивы к проколам. Зелёный выдерживает нагрузку до 30кг. Белый выдерживает нагрузку до 50кг.",
    image: `/images/инструм/мешки.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Другое",
    sizeText: "Выберите мешок:",
    pricesBySize: {
      "зелёный": 15,
      "белый": 20
    },
    urlId: "meshki-dlya-stroitelnogo-musora"
  },
  {
    id: uuidv4(),
    title: "Ванночка (330х350мм)",
    description: "Пластиковая ванночка для краски, штукатурки, шпатлёвки. Удобна при окрашивании валиком или приготовлении смесей.",
    image: `/images/инструм/ванночка.webp`,
    mainCategory: "Инструменты и расходные материалы",
    subCategory: "Другое",
    price: 150,
    urlId: "vannochka"
  }
];

// Маппинг категорий в slug (должен соответствовать menuCategories.ts)
export const categoryToSlug: Record<string, string> = {
  'Профнастил': 'profnastil',
  'Сухие смеси': 'suhie-smesi',
  'Древесные плиты': 'drevesnye-plity',
  'Вагонка и бруски': 'vagonka-i-bruski',
  'Гипсокартон': 'gipsokarton',
  'Профиля и направляющие': 'profilya-i-napravlyayuschie',
  'Маяки и перфорированные углы': 'mayaki-i-perforirovannye-ugly',
  'Профтрубы и металлические углы': 'proftruby-i-metallicheskie-ugly',
  'Арматура и кладочная сетка': 'armatura-i-kladochnaya-setka',
  'Утеплители': 'utepliteli',
  'Изоляция': 'izolyaciya',
  'Гидроизоляция': 'gidroizolyaciya',
  'Лакокрасочные материалы': 'lakokrasochnye-materialy',
  'Отделка': 'otdelka',
  'Крепёж': 'krepezh',
  'Инструменты и расходные материалы': 'instrumenty-i-rashodnye-materialy',
};

// Обратный маппинг slug в категорию
export const slugToCategory: Record<string, string> = Object.fromEntries(
  Object.entries(categoryToSlug).map(([k, v]) => [v, k])
);

// Маппинг подкатегорий в slug (должен соответствовать menuCategories.ts)
export const subcategoryToSlug: Record<string, string> = {
  // Профнастил
  'МП-20': 'mp-20',
  'С-8': 's-8',
  'С-20': 's-20',
  'С-21': 's-21',
  'НС-35': 'ns-35',
  // Сухие смеси (ВАЖНО: slug должен соответствовать menuCategories.ts)
  'Штукатурка': 'shtukaturka',
  'Шпатлёвка': 'shpatlevka',
  'Декоративная штукатурка': 'dekorativnaya-shtukaturka',
  'Смеси для пола': 'smesi-dlya-pola',
  'Плиточный клей': 'plitochnyy-kley',
  'Штукатурно-клеевая смесь': 'shtukaturno-kleevaya-smes',
  'Монтажный клей': 'montazhnyy-kley',
  'Клей для блоков': 'kley-dlya-blokov',
  'Цемент': 'cement',
  'Затирка для плитки': 'zatirka-dlya-plitki',
  // Древесные плиты
  'ОСП (OSB)': 'osp',
  'ОСП': 'osp',
  'ДСП': 'dsp',
  'ДВП': 'dvp',
  'Фанера': 'fanera',
  // Вагонка и бруски
  'Вагонка': 'vagonka',
  'Бруски': 'bruski',
  // Гипсокартон
  'Для сухих помещений': 'dlya-suhih-pomescheniy',
  'Влагостойкий': 'vlagostoykiy',
  'ГКЛ': 'dlya-suhih-pomescheniy',
  'ГКЛВ': 'vlagostoykiy',
  'ГКЛО': 'gklo',
  'ГВЛ': 'gvl',
  // Профиля и направляющие
  'Стеновые': 'stenovye',
  'Перегородочные': 'peregorodochnye',
  'Профиля': 'stenovye',
  'Направляющие': 'peregorodochnye',
  // Маяки и перфорированные углы
  'Маяки': 'mayaki',
  'Перфорированные углы': 'perforirovannye-ugly',
  // Профтрубы
  'Профтрубы': 'proftruby',
  'Металлические углы': 'metallicheskie-ugly',
  // Арматура
  'Стеклопластиковая арматура': 'stekloplastikovaya-armatura',
  'Арматура': 'stekloplastikovaya-armatura',
  'Кладочная сетка': 'kladochnaya-setka',
  // Утеплители
  'Пенополистирол': 'penopolistirol',
  'Пенопласт': 'penoplast',
  'Каменная и минеральная вата': 'kamennaya-i-mineralnaya-vata',
  'Минеральная вата': 'kamennaya-i-mineralnaya-vata',
  'Экструдированный пенополистирол': 'penopolistirol',
  // Изоляция
  'Отражающая теплоизоляция': 'otrazhayuschaya-teploizolyaciya',
  'Пароизоляция': 'paroizolyaciya',
  'Гидро-пароизоляция': 'gidro-paroizolyaciya',
  'Ветро-влагозащита': 'vetro-vlagozaschita',
  'Ветрозащита': 'vetro-vlagozaschita',
  // Гидроизоляция
  'Сухая смесь': 'suhaya-smes',
  'Жидкая гидроизоляция': 'zhidkaya-gidroizolyaciya',
  'Лента гидроизоляционная': 'lenta-gidroizolyacionnaya',
  'Битумные рулоны': 'bitumnye-rulony',
  'Рулонная гидроизоляция': 'bitumnye-rulony',
  'Битумная мастика': 'zhidkaya-gidroizolyaciya',
  // Лакокрасочные материалы
  'Водоэмульсионные краски': 'vodoemulsionnye-kraski',
  'Краска': 'vodoemulsionnye-kraski',
  'Эмали': 'emali',
  'Эмаль': 'emali',
  'Лаки и пропитки': 'laki-i-propitki',
  'Лак': 'laki-i-propitki',
  'Грунтовка': 'gruntovka',
  // Отделка
  'Грунт': 'gruntovka',
  'Бетоноконтакт': 'betonokontakt',
  'Готовые шпатлёвки': 'gotovye-shpatlevki',
  'Шпатлёвки готовые': 'gotovye-shpatlevki',
  'Монтажная пена и пена клей': 'montazhnaya-pena-i-pena-kley',
  'Монтажная пена': 'montazhnaya-pena-i-pena-kley',
  'Герметик': 'germetik',
  'Клей': 'kley',
  'Стеклосетка и стеклохолст': 'steklosetka-i-stekloholst',
  'Стеклообои и стеклохолст': 'steklosetka-i-stekloholst',
  'Ленты и скотчи': 'lenty-i-skotchi',
  // Крепёж
  'Саморезы для гипсокартона': 'samorezy-dlya-gipsokartona',
  'Кровельные саморезы': 'krovelnye-samorezy',
  'Дюбеля': 'dyubelya',
  'Гвозди': 'gvozdi',
  'Болты, гайки': 'bolty-gayki',
  'Крепёжные уголки и подвесы': 'krepezhnye-ugolki-i-podvesy',
  'Удлинитель профилей и крабы': 'udlinitel-profiley-i-kraby',
  // Инструменты
  'Абразивные диски': 'abrazivnye-diski',
  'Свёрла, биты и буры': 'sverla-bity-i-bury',
  'СВП': 'svp',
  'Валики': 'valiki',
  'Шпатели': 'shpateli',
  'Кисти': 'kisti',
  'Монтажные пистолеты': 'montazhnye-pistolety',
  'Тара и ёмкости': 'tara-i-emkosti',
  'Другое': 'drugoe',
};

// Обратный маппинг slug в подкатегорию
export const slugToSubcategory: Record<string, string> = Object.fromEntries(
  Object.entries(subcategoryToSlug).map(([k, v]) => [v, k])
);

// Получение slug для категории
export function getCategorySlug(category: string): string {
  return categoryToSlug[category] || category.toLowerCase().replace(/\s+/g, '-');
}

// Получение slug для подкатегории
export function getSubcategorySlug(subcategory: string): string {
  return subcategoryToSlug[subcategory] || subcategory.toLowerCase().replace(/\s+/g, '-');
}

// Получение товаров по категории и подкатегории
export function getProductsByCategory(mainCategory: string, subCategory?: string): Product[] {
  return products.filter(p => {
    if (subCategory) {
      return p.mainCategory === mainCategory && p.subCategory === subCategory;
    }
    return p.mainCategory === mainCategory;
  });
}

// Получение товаров по slug
export function getProductsBySlugs(categorySlug: string, subcategorySlug?: string): Product[] {
  const category = slugToCategory[categorySlug];
  const subcategory = subcategorySlug ? slugToSubcategory[subcategorySlug] : undefined;
  
  if (!category) return [];
  
  return getProductsByCategory(category, subcategory);
}

// Получение товара по urlId
export function getProductByUrlId(urlId: string): Product | undefined {
  return products.find(p => p.urlId === urlId);
}

// Получение всех категорий
export function getCategories(): string[] {
  return [...new Set(products.map(p => p.mainCategory))];
}

// Получение подкатегорий для категории
export function getSubcategories(mainCategory: string): string[] {
  return [...new Set(products.filter(p => p.mainCategory === mainCategory).map(p => p.subCategory))];
}

export default products;